GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
extern volatile SPI2CLKbits_t SPI2CLKbits __at(0x099);
// bitfield macros
#define _SPI2CLK_CLKSEL_POSN                                0x0
#define _SPI2CLK_CLKSEL_POSITION                            0x0
#define _SPI2CLK_CLKSEL_SIZE                                0x8
#define _SPI2CLK_CLKSEL_LENGTH                              0x8
#define _SPI2CLK_CLKSEL_MASK                                0xFF
#define _SPI2CLK_CLKSEL0_POSN                               0x0
#define _SPI2CLK_CLKSEL0_POSITION                           0x0
#define _SPI2CLK_CLKSEL0_SIZE                               0x1
#define _SPI2CLK_CLKSEL0_LENGTH                             0x1
#define _SPI2CLK_CLKSEL0_MASK                               0x1
#define _SPI2CLK_CLKSEL1_POSN                               0x1
#define _SPI2CLK_CLKSEL1_POSITION                           0x1
#define _SPI2CLK_CLKSEL1_SIZE                               0x1
#define _SPI2CLK_CLKSEL1_LENGTH                             0x1
#define _SPI2CLK_CLKSEL1_MASK                               0x2
#define _SPI2CLK_CLKSEL2_POSN                               0x2
#define _SPI2CLK_CLKSEL2_POSITION                           0x2
#define _SPI2CLK_CLKSEL2_SIZE                               0x1
#define _SPI2CLK_CLKSEL2_LENGTH                             0x1
#define _SPI2CLK_CLKSEL2_MASK                               0x4
#define _SPI2CLK_CLKSEL3_POSN                               0x3
#define _SPI2CLK_CLKSEL3_POSITION                           0x3
#define _SPI2CLK_CLKSEL3_SIZE                               0x1
#define _SPI2CLK_CLKSEL3_LENGTH                             0x1
#define _SPI2CLK_CLKSEL3_MASK                               0x8
#define _SPI2CLK_CLKSEL4_POSN                               0x4
#define _SPI2CLK_CLKSEL4_POSITION                           0x4
#define _SPI2CLK_CLKSEL4_SIZE                               0x1
#define _SPI2CLK_CLKSEL4_LENGTH                             0x1
#define _SPI2CLK_CLKSEL4_MASK                               0x10
#define _SPI2CLK_SPI2CLKSEL_POSN                            0x0
#define _SPI2CLK_SPI2CLKSEL_POSITION                        0x0
#define _SPI2CLK_SPI2CLKSEL_SIZE                            0x8
#define _SPI2CLK_SPI2CLKSEL_LENGTH                          0x8
#define _SPI2CLK_SPI2CLKSEL_MASK                            0xFF
#define _SPI2CLK_SPI2CLKSEL0_POSN                           0x0
#define _SPI2CLK_SPI2CLKSEL0_POSITION                       0x0
#define _SPI2CLK_SPI2CLKSEL0_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL0_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL0_MASK                           0x1
#define _SPI2CLK_SPI2CLKSEL1_POSN                           0x1
#define _SPI2CLK_SPI2CLKSEL1_POSITION                       0x1
#define _SPI2CLK_SPI2CLKSEL1_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL1_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL1_MASK                           0x2
#define _SPI2CLK_SPI2CLKSEL2_POSN                           0x2
#define _SPI2CLK_SPI2CLKSEL2_POSITION                       0x2
#define _SPI2CLK_SPI2CLKSEL2_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL2_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL2_MASK                           0x4
#define _SPI2CLK_SPI2CLKSEL3_POSN                           0x3
#define _SPI2CLK_SPI2CLKSEL3_POSITION                       0x3
#define _SPI2CLK_SPI2CLKSEL3_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL3_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL3_MASK                           0x8
#define _SPI2CLK_SPI2CLKSEL4_POSN                           0x4
#define _SPI2CLK_SPI2CLKSEL4_POSITION                       0x4
#define _SPI2CLK_SPI2CLKSEL4_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL4_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL4_MASK                           0x10

// Register: ACTCON
#define ACTCON ACTCON
extern volatile unsigned char           ACTCON              __at(0x0AC);
#ifndef _LIB_BUILD
asm("ACTCON equ 0ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ORS                    :1;
        unsigned                        :1;
        unsigned LOCK                   :1;
        unsigned                        :2;
        unsigned UD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :1;
        unsigned ACTORS                 :1;
        unsigned                        :1;
        unsigned ACTLOCK                :1;
        unsigned                        :2;
        unsigned ACTUD                  :1;
        unsigned ACTEN                  :1;
    };
} ACTCONbits_t;
extern volatile ACTCONbits_t ACTCONbits __at(0x0AC);
// bitfield macros
#define _ACTCON_ORS_POSN                                    0x1
#define _ACTCON_ORS_POSITION                                0x1
#define _ACTCON_ORS_SIZE                                    0x1
#define _ACTCON_ORS_LENGTH                                  0x1
#define _ACTCON_ORS_MASK                                    0x2
#define _ACTCON_LOCK_POSN                                   0x3
#define _ACTCON_LOCK_POSITION                               0x3
#define _ACTCON_LOCK_SIZE                                   0x1
#define _ACTCON_LOCK_LENGTH                                 0x1
#define _ACTCON_LOCK_MASK                                   0x8
#define _ACTCON_UD_POSN                                     0x6
#define _ACTCON_UD_POSITION                                 0x6
#define _ACTCON_UD_SIZE                                     0x1
#define _ACTCON_UD_LENGTH                                   0x1
#define _ACTCON_UD_MASK                                     0x40
#define _ACTCON_EN_POSN                                     0x7
#define _ACTCON_EN_POSITION                                 0x7
#define _ACTCON_EN_SIZE                                     0x1
#define _ACTCON_EN_LENGTH                                   0x1
#define _ACTCON_EN_MASK                                     0x80
#define _ACTCON_ACTORS_POSN                                 0x1
#define _ACTCON_ACTORS_POSITION                             0x1
#define _ACTCON_ACTORS_SIZE                                 0x1
#define _ACTCON_ACTORS_LENGTH                               0x1
#define _ACTCON_ACTORS_MASK                                 0x2
#define _ACTCON_ACTLOCK_POSN                                0x3
#define _ACTCON_ACTLOCK_POSITION                            0x3
#define _ACTCON_ACTLOCK_SIZE                                0x1
#define _ACTCON_ACTLOCK_LENGTH                              0x1
#define _ACTCON_ACTLOCK_MASK                                0x8
#define _ACTCON_ACTUD_POSN                                  0x6
#define _ACTCON_ACTUD_POSITION                              0x6
#define _ACTCON_ACTUD_SIZE                                  0x1
#define _ACTCON_ACTUD_LENGTH                                0x1
#define _ACTCON_ACTUD_MASK                                  0x40
#define _ACTCON_ACTEN_POSN                                  0x7
#define _ACTCON_ACTEN_POSITION                              0x7
#define _ACTCON_ACTEN_SIZE                                  0x1
#define _ACTCON_ACTEN_LENGTH                                0x1
#define _ACTCON_ACTEN_MASK                                  0x80

// Register: OSCCON1
#define OSCCON1 OSCCON1
extern volatile unsigned char           OSCCON1             __at(0x0AD);
#ifndef _LIB_BUILD
asm("OSCCON1 equ 0ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NDIV                   :4;
        unsigned NOSC                   :3;
    };
    struct {
        unsigned NDIV0                  :1;
        unsigned NDIV1                  :1;
        unsigned NDIV2                  :1;
        unsigned NDIV3                  :1;
        unsigned NOSC0                  :1;
        unsigned NOSC1                  :1;
        unsigned NOSC2                  :1;
    };
} OSCCON1bits_t;
extern volatile OSCCON1bits_t OSCCON1bits __at(0x0AD);
// bitfield macros
#define _OSCCON1_NDIV_POSN                                  0x0
#define _OSCCON1_NDIV_POSITION                              0x0
#define _OSCCON1_NDIV_SIZE                                  0x4
#define _OSCCON1_NDIV_LENGTH                                0x4
#define _OSCCON1_NDIV_MASK                                  0xF
#define _OSCCON1_NOSC_POSN                                  0x4
#define _OSCCON1_NOSC_POSITION                              0x4
#define _OSCCON1_NOSC_SIZE                                  0x3
#define _OSCCON1_NOSC_LENGTH                                0x3
#define _OSCCON1_NOSC_MASK                                  0x70
#define _OSCCON1_NDIV0_POSN                                 0x0
#define _OSCCON1_NDIV0_POSITION                             0x0
#define _OSCCON1_NDIV0_SIZE                                 0x1
#define _OSCCON1_NDIV0_LENGTH                               0x1
#define _OSCCON1_NDIV0_MASK                                 0x1
#define _OSCCON1_NDIV1_POSN                                 0x1
#define _OSCCON1_NDIV1_POSITION                             0x1
#define _OSCCON1_NDIV1_SIZE                                 0x1
#define _OSCCON1_NDIV1_LENGTH                               0x1
#define _OSCCON1_NDIV1_MASK                                 0x2
#define _OSCCON1_NDIV2_POSN                                 0x2
#define _OSCCON1_NDIV2_POSITION                             0x2
#define _OSCCON1_NDIV2_SIZE                                 0x1
#define _OSCCON1_NDIV2_LENGTH                               0x1
#define _OSCCON1_NDIV2_MASK                                 0x4
#define _OSCCON1_NDIV3_POSN                                 0x3
#define _OSCCON1_NDIV3_POSITION                             0x3
#define _OSCCON1_NDIV3_SIZE                                 0x1
#define _OSCCON1_NDIV3_LENGTH                               0x1
#define _OSCCON1_NDIV3_MASK                                 0x8
#define _OSCCON1_NOSC0_POSN                                 0x4
#define _OSCCON1_NOSC0_POSITION                             0x4
#define _OSCCON1_NOSC0_SIZE                                 0x1
#define _OSCCON1_NOSC0_LENGTH                               0x1
#define _OSCCON1_NOSC0_MASK                                 0x10
#define _OSCCON1_NOSC1_POSN                                 0x5
#define _OSCCON1_NOSC1_POSITION                             0x5
#define _OSCCON1_NOSC1_SIZE                                 0x1
#define _OSCCON1_NOSC1_LENGTH                               0x1
#define _OSCCON1_NOSC1_MASK                                 0x20
#define _OSCCON1_NOSC2_POSN                                 0x6
#define _OSCCON1_NOSC2_POSITION                             0x6
#define _OSCCON1_NOSC2_SIZE                                 0x1
#define _OSCCON1_NOSC2_LENGTH                               0x1
#define _OSCCON1_NOSC2_MASK                                 0x40

// Register: OSCCON2
#define OSCCON2 OSCCON2
extern volatile unsigned char           OSCCON2             __at(0x0AE);
#ifndef _LIB_BUILD
asm("OSCCON2 equ 0AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CDIV                   :4;
        unsigned COSC                   :3;
    };
    struct {
        unsigned CDIV0                  :1;
        unsigned CDIV1                  :1;
        unsigned CDIV2                  :1;
        unsigned CDIV3                  :1;
        unsigned COSC0                  :1;
        unsigned COSC1                  :1;
        unsigned COSC2                  :1;
    };
} OSCCON2bits_t;
extern volatile OSCCON2bits_t OSCCON2bits __at(0x0AE);
// bitfield macros
#define _OSCCON2_CDIV_POSN                                  0x0
#define _OSCCON2_CDIV_POSITION                              0x0
#define _OSCCON2_CDIV_SIZE                                  0x4
#define _OSCCON2_CDIV_LENGTH                                0x4
#define _OSCCON2_CDIV_MASK                                  0xF
#define _OSCCON2_COSC_POSN                                  0x4
#define _OSCCON2_COSC_POSITION                              0x4
#define _OSCCON2_COSC_SIZE                                  0x3
#define _OSCCON2_COSC_LENGTH                                0x3
#define _OSCCON2_COSC_MASK                                  0x70
#define _OSCCON2_CDIV0_POSN                                 0x0
#define _OSCCON2_CDIV0_POSITION                             0x0
#define _OSCCON2_CDIV0_SIZE                                 0x1
#define _OSCCON2_CDIV0_LENGTH                               0x1
#define _OSCCON2_CDIV0_MASK                                 0x1
#define _OSCCON2_CDIV1_POSN                                 0x1
#define _OSCCON2_CDIV1_POSITION                             0x1
#define _OSCCON2_CDIV1_SIZE                                 0x1
#define _OSCCON2_CDIV1_LENGTH                               0x1
#define _OSCCON2_CDIV1_MASK                                 0x2
#define _OSCCON2_CDIV2_POSN                                 0x2
#define _OSCCON2_CDIV2_POSITION                             0x2
#define _OSCCON2_CDIV2_SIZE                                 0x1
#define _OSCCON2_CDIV2_LENGTH                               0x1
#define _OSCCON2_CDIV2_MASK                                 0x4
#define _OSCCON2_CDIV3_POSN                                 0x3
#define _OSCCON2_CDIV3_POSITION                             0x3
#define _OSCCON2_CDIV3_SIZE                                 0x1
#define _OSCCON2_CDIV3_LENGTH                               0x1
#define _OSCCON2_CDIV3_MASK                                 0x8
#define _OSCCON2_COSC0_POSN                                 0x4
#define _OSCCON2_COSC0_POSITION                             0x4
#define _OSCCON2_COSC0_SIZE                                 0x1
#define _OSCCON2_COSC0_LENGTH                               0x1
#define _OSCCON2_COSC0_MASK                                 0x10
#define _OSCCON2_COSC1_POSN                                 0x5
#define _OSCCON2_COSC1_POSITION                             0x5
#define _OSCCON2_COSC1_SIZE                                 0x1
#define _OSCCON2_COSC1_LENGTH                               0x1
#define _OSCCON2_COSC1_MASK                                 0x20
#define _OSCCON2_COSC2_POSN                                 0x6
#define _OSCCON2_COSC2_POSITION                             0x6
#define _OSCCON2_COSC2_SIZE                                 0x1
#define _OSCCON2_COSC2_LENGTH                               0x1
#define _OSCCON2_COSC2_MASK                                 0x40

// Register: OSCCON3
#define OSCCON3 OSCCON3
extern volatile unsigned char           OSCCON3             __at(0x0AF);
#ifndef _LIB_BUILD
asm("OSCCON3 equ 0AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned NOSCR                  :1;
        unsigned ORDY                   :1;
        unsigned                        :1;
        unsigned SOSCPWR                :1;
        unsigned CSWHOLD                :1;
    };
} OSCCON3bits_t;
extern volatile OSCCON3bits_t OSCCON3bits __at(0x0AF);
// bitfield macros
#define _OSCCON3_NOSCR_POSN                                 0x3
#define _OSCCON3_NOSCR_POSITION                             0x3
#define _OSCCON3_NOSCR_SIZE                                 0x1
#define _OSCCON3_NOSCR_LENGTH                               0x1
#define _OSCCON3_NOSCR_MASK                                 0x8
#define _OSCCON3_ORDY_POSN                                  0x4
#define _OSCCON3_ORDY_POSITION                              0x4
#define _OSCCON3_ORDY_SIZE                                  0x1
#define _OSCCON3_ORDY_LENGTH                                0x1
#define _OSCCON3_ORDY_MASK                                  0x10
#define _OSCCON3_SOSCPWR_POSN                               0x6
#define _OSCCON3_SOSCPWR_POSITION                           0x6
#define _OSCCON3_SOSCPWR_SIZE                               0x1
#define _OSCCON3_SOSCPWR_LENGTH                             0x1
#define _OSCCON3_SOSCPWR_MASK                               0x40
#define _OSCCON3_CSWHOLD_POSN                               0x7
#define _OSCCON3_CSWHOLD_POSITION                           0x7
#define _OSCCON3_CSWHOLD_SIZE                               0x1
#define _OSCCON3_CSWHOLD_LENGTH                             0x1
#define _OSCCON3_CSWHOLD_MASK                               0x80

