GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
extern volatile CLCIN5PPSbits_t CLCIN5PPSbits __at(0x266);
// bitfield macros
#define _CLCIN5PPS_PIN_POSN                                 0x0
#define _CLCIN5PPS_PIN_POSITION                             0x0
#define _CLCIN5PPS_PIN_SIZE                                 0x3
#define _CLCIN5PPS_PIN_LENGTH                               0x3
#define _CLCIN5PPS_PIN_MASK                                 0x7
#define _CLCIN5PPS_PORT_POSN                                0x3
#define _CLCIN5PPS_PORT_POSITION                            0x3
#define _CLCIN5PPS_PORT_SIZE                                0x2
#define _CLCIN5PPS_PORT_LENGTH                              0x2
#define _CLCIN5PPS_PORT_MASK                                0x18
#define _CLCIN5PPS_CLCIN5PPS0_POSN                          0x0
#define _CLCIN5PPS_CLCIN5PPS0_POSITION                      0x0
#define _CLCIN5PPS_CLCIN5PPS0_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS0_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS0_MASK                          0x1
#define _CLCIN5PPS_CLCIN5PPS1_POSN                          0x1
#define _CLCIN5PPS_CLCIN5PPS1_POSITION                      0x1
#define _CLCIN5PPS_CLCIN5PPS1_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS1_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS1_MASK                          0x2
#define _CLCIN5PPS_CLCIN5PPS2_POSN                          0x2
#define _CLCIN5PPS_CLCIN5PPS2_POSITION                      0x2
#define _CLCIN5PPS_CLCIN5PPS2_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS2_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS2_MASK                          0x4
#define _CLCIN5PPS_CLCIN5PPS3_POSN                          0x3
#define _CLCIN5PPS_CLCIN5PPS3_POSITION                      0x3
#define _CLCIN5PPS_CLCIN5PPS3_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS3_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS3_MASK                          0x8
#define _CLCIN5PPS_CLCIN5PPS4_POSN                          0x4
#define _CLCIN5PPS_CLCIN5PPS4_POSITION                      0x4
#define _CLCIN5PPS_CLCIN5PPS4_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS4_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS4_MASK                          0x10
#define _CLCIN5PPS_CLCIN5PPS_POSN                           0x0
#define _CLCIN5PPS_CLCIN5PPS_POSITION                       0x0
#define _CLCIN5PPS_CLCIN5PPS_SIZE                           0x5
#define _CLCIN5PPS_CLCIN5PPS_LENGTH                         0x5
#define _CLCIN5PPS_CLCIN5PPS_MASK                           0x1F

// Register: CLCIN6PPS
#define CLCIN6PPS CLCIN6PPS
extern volatile unsigned char           CLCIN6PPS           __at(0x267);
#ifndef _LIB_BUILD
asm("CLCIN6PPS equ 0267h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CLCIN6PPS0             :1;
        unsigned CLCIN6PPS1             :1;
        unsigned CLCIN6PPS2             :1;
        unsigned CLCIN6PPS3             :1;
        unsigned CLCIN6PPS4             :1;
    };
    struct {
        unsigned CLCIN6PPS              :5;
    };
} CLCIN6PPSbits_t;
extern volatile CLCIN6PPSbits_t CLCIN6PPSbits __at(0x267);
// bitfield macros
#define _CLCIN6PPS_PIN_POSN                                 0x0
#define _CLCIN6PPS_PIN_POSITION                             0x0
#define _CLCIN6PPS_PIN_SIZE                                 0x3
#define _CLCIN6PPS_PIN_LENGTH                               0x3
#define _CLCIN6PPS_PIN_MASK                                 0x7
#define _CLCIN6PPS_PORT_POSN                                0x3
#define _CLCIN6PPS_PORT_POSITION                            0x3
#define _CLCIN6PPS_PORT_SIZE                                0x2
#define _CLCIN6PPS_PORT_LENGTH                              0x2
#define _CLCIN6PPS_PORT_MASK                                0x18
#define _CLCIN6PPS_CLCIN6PPS0_POSN                          0x0
#define _CLCIN6PPS_CLCIN6PPS0_POSITION                      0x0
#define _CLCIN6PPS_CLCIN6PPS0_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS0_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS0_MASK                          0x1
#define _CLCIN6PPS_CLCIN6PPS1_POSN                          0x1
#define _CLCIN6PPS_CLCIN6PPS1_POSITION                      0x1
#define _CLCIN6PPS_CLCIN6PPS1_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS1_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS1_MASK                          0x2
#define _CLCIN6PPS_CLCIN6PPS2_POSN                          0x2
#define _CLCIN6PPS_CLCIN6PPS2_POSITION                      0x2
#define _CLCIN6PPS_CLCIN6PPS2_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS2_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS2_MASK                          0x4
#define _CLCIN6PPS_CLCIN6PPS3_POSN                          0x3
#define _CLCIN6PPS_CLCIN6PPS3_POSITION                      0x3
#define _CLCIN6PPS_CLCIN6PPS3_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS3_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS3_MASK                          0x8
#define _CLCIN6PPS_CLCIN6PPS4_POSN                          0x4
#define _CLCIN6PPS_CLCIN6PPS4_POSITION                      0x4
#define _CLCIN6PPS_CLCIN6PPS4_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS4_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS4_MASK                          0x10
#define _CLCIN6PPS_CLCIN6PPS_POSN                           0x0
#define _CLCIN6PPS_CLCIN6PPS_POSITION                       0x0
#define _CLCIN6PPS_CLCIN6PPS_SIZE                           0x5
#define _CLCIN6PPS_CLCIN6PPS_LENGTH                         0x5
#define _CLCIN6PPS_CLCIN6PPS_MASK                           0x1F

// Register: CLCIN7PPS
#define CLCIN7PPS CLCIN7PPS
extern volatile unsigned char           CLCIN7PPS           __at(0x268);
#ifndef _LIB_BUILD
asm("CLCIN7PPS equ 0268h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CLCIN7PPS0             :1;
        unsigned CLCIN7PPS1             :1;
        unsigned CLCIN7PPS2             :1;
        unsigned CLCIN7PPS3             :1;
        unsigned CLCIN7PPS4             :1;
    };
    struct {
        unsigned CLCIN7PPS              :5;
    };
} CLCIN7PPSbits_t;
extern volatile CLCIN7PPSbits_t CLCIN7PPSbits __at(0x268);
// bitfield macros
#define _CLCIN7PPS_PIN_POSN                                 0x0
#define _CLCIN7PPS_PIN_POSITION                             0x0
#define _CLCIN7PPS_PIN_SIZE                                 0x3
#define _CLCIN7PPS_PIN_LENGTH                               0x3
#define _CLCIN7PPS_PIN_MASK                                 0x7
#define _CLCIN7PPS_PORT_POSN                                0x3
#define _CLCIN7PPS_PORT_POSITION                            0x3
#define _CLCIN7PPS_PORT_SIZE                                0x2
#define _CLCIN7PPS_PORT_LENGTH                              0x2
#define _CLCIN7PPS_PORT_MASK                                0x18
#define _CLCIN7PPS_CLCIN7PPS0_POSN                          0x0
#define _CLCIN7PPS_CLCIN7PPS0_POSITION                      0x0
#define _CLCIN7PPS_CLCIN7PPS0_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS0_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS0_MASK                          0x1
#define _CLCIN7PPS_CLCIN7PPS1_POSN                          0x1
#define _CLCIN7PPS_CLCIN7PPS1_POSITION                      0x1
#define _CLCIN7PPS_CLCIN7PPS1_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS1_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS1_MASK                          0x2
#define _CLCIN7PPS_CLCIN7PPS2_POSN                          0x2
#define _CLCIN7PPS_CLCIN7PPS2_POSITION                      0x2
#define _CLCIN7PPS_CLCIN7PPS2_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS2_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS2_MASK                          0x4
#define _CLCIN7PPS_CLCIN7PPS3_POSN                          0x3
#define _CLCIN7PPS_CLCIN7PPS3_POSITION                      0x3
#define _CLCIN7PPS_CLCIN7PPS3_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS3_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS3_MASK                          0x8
#define _CLCIN7PPS_CLCIN7PPS4_POSN                          0x4
#define _CLCIN7PPS_CLCIN7PPS4_POSITION                      0x4
#define _CLCIN7PPS_CLCIN7PPS4_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS4_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS4_MASK                          0x10
#define _CLCIN7PPS_CLCIN7PPS_POSN                           0x0
#define _CLCIN7PPS_CLCIN7PPS_POSITION                       0x0
#define _CLCIN7PPS_CLCIN7PPS_SIZE                           0x5
#define _CLCIN7PPS_CLCIN7PPS_LENGTH                         0x5
#define _CLCIN7PPS_CLCIN7PPS_MASK                           0x1F

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
extern volatile unsigned char           ADACTPPS            __at(0x269);
#ifndef _LIB_BUILD
asm("ADACTPPS equ 0269h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned ADACTPPS0              :1;
        unsigned ADACTPPS1              :1;
        unsigned ADACTPPS2              :1;
        unsigned ADACTPPS3              :1;
        unsigned ADACTPPS4              :1;
    };
    struct {
        unsigned ADACTPPS               :5;
    };
} ADACTPPSbits_t;
extern volatile ADACTPPSbits_t ADACTPPSbits __at(0x269);
// bitfield macros
#define _ADACTPPS_PIN_POSN                                  0x0
#define _ADACTPPS_PIN_POSITION                              0x0
#define _ADACTPPS_PIN_SIZE                                  0x3
#define _ADACTPPS_PIN_LENGTH                                0x3
#define _ADACTPPS_PIN_MASK                                  0x7
#define _ADACTPPS_PORT_POSN                                 0x3
#define _ADACTPPS_PORT_POSITION                             0x3
#define _ADACTPPS_PORT_SIZE                                 0x2
#define _ADACTPPS_PORT_LENGTH                               0x2
#define _ADACTPPS_PORT_MASK                                 0x18
#define _ADACTPPS_ADACTPPS0_POSN                            0x0
#define _ADACTPPS_ADACTPPS0_POSITION                        0x0
#define _ADACTPPS_ADACTPPS0_SIZE                            0x1
#define _ADACTPPS_ADACTPPS0_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS0_MASK                            0x1
#define _ADACTPPS_ADACTPPS1_POSN                            0x1
#define _ADACTPPS_ADACTPPS1_POSITION                        0x1
#define _ADACTPPS_ADACTPPS1_SIZE                            0x1
#define _ADACTPPS_ADACTPPS1_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS1_MASK                            0x2
#define _ADACTPPS_ADACTPPS2_POSN                            0x2
#define _ADACTPPS_ADACTPPS2_POSITION                        0x2
#define _ADACTPPS_ADACTPPS2_SIZE                            0x1
#define _ADACTPPS_ADACTPPS2_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS2_MASK                            0x4
#define _ADACTPPS_ADACTPPS3_POSN                            0x3
#define _ADACTPPS_ADACTPPS3_POSITION                        0x3
#define _ADACTPPS_ADACTPPS3_SIZE                            0x1
#define _ADACTPPS_ADACTPPS3_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS3_MASK                            0x8
#define _ADACTPPS_ADACTPPS4_POSN                            0x4
#define _ADACTPPS_ADACTPPS4_POSITION                        0x4
#define _ADACTPPS_ADACTPPS4_SIZE                            0x1
#define _ADACTPPS_ADACTPPS4_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS4_MASK                            0x10
#define _ADACTPPS_ADACTPPS_POSN                             0x0
#define _ADACTPPS_ADACTPPS_POSITION                         0x0
#define _ADACTPPS_ADACTPPS_SIZE                             0x5
#define _ADACTPPS_ADACTPPS_LENGTH                           0x5
#define _ADACTPPS_ADACTPPS_MASK                             0x1F

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
extern volatile unsigned char           SPI1SCKPPS          __at(0x26A);
#ifndef _LIB_BUILD
asm("SPI1SCKPPS equ 026Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SPI1SCKPPS             :5;
    };
    struct {
        unsigned SPI1SCKPPS0            :1;
        unsigned SPI1SCKPPS1            :1;
        unsigned SPI1SCKPPS2            :1;
        unsigned SPI1SCKPPS3            :1;
        unsigned SPI1SCKPPS4            :1;
    };
} SPI1SCKPPSbits_t;
extern volatile SPI1SCKPPSbits_t SPI1SCKPPSbits __at(0x26A);
// bitfield macros
#define _SPI1SCKPPS_PIN_POSN                                0x0
#define _SPI1SCKPPS_PIN_POSITION                            0x0
#define _SPI1SCKPPS_PIN_SIZE                                0x3
#define _SPI1SCKPPS_PIN_LENGTH                              0x3
#define _SPI1SCKPPS_PIN_MASK                                0x7
#define _SPI1SCKPPS_PORT_POSN                               0x3
#define _SPI1SCKPPS_PORT_POSITION                           0x3
#define _SPI1SCKPPS_PORT_SIZE                               0x2
#define _SPI1SCKPPS_PORT_LENGTH                             0x2
#define _SPI1SCKPPS_PORT_MASK                               0x18
#define _SPI1SCKPPS_SPI1SCKPPS_POSN                         0x0
#define _SPI1SCKPPS_SPI1SCKPPS_POSITION                     0x0
#define _SPI1SCKPPS_SPI1SCKPPS_SIZE                         0x5
#define _SPI1SCKPPS_SPI1SCKPPS_LENGTH                       0x5
#define _SPI1SCKPPS_SPI1SCKPPS_MASK                         0x1F
#define _SPI1SCKPPS_SPI1SCKPPS0_POSN                        0x0
#define _SPI1SCKPPS_SPI1SCKPPS0_POSITION                    0x0
#define _SPI1SCKPPS_SPI1SCKPPS0_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS0_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS0_MASK                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_POSN                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_POSITION                    0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_MASK                        0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_POSN                        0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_POSITION                    0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS2_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS2_MASK                        0x4
#define _SPI1SCKPPS_SPI1SCKPPS3_POSN                        0x3
#define _SPI1SCKPPS_SPI1SCKPPS3_POSITION                    0x3
#define _SPI1SCKPPS_SPI1SCKPPS3_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS3_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS3_MASK                        0x8
#define _SPI1SCKPPS_SPI1SCKPPS4_POSN                        0x4
#define _SPI1SCKPPS_SPI1SCKPPS4_POSITION                    0x4
#define _SPI1SCKPPS_SPI1SCKPPS4_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS4_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS4_MASK                        0x10

