GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
// Register: U3P3L
#define U3P3L U3P3L
extern volatile unsigned char           U3P3L               __at(0x2CF);
#ifndef _LIB_BUILD
asm("U3P3L equ 02CFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3L                    :8;
    };
} U3P3Lbits_t;
extern volatile U3P3Lbits_t U3P3Lbits __at(0x2CF);
// bitfield macros
#define _U3P3L_P3L_POSN                                     0x0
#define _U3P3L_P3L_POSITION                                 0x0
#define _U3P3L_P3L_SIZE                                     0x8
#define _U3P3L_P3L_LENGTH                                   0x8
#define _U3P3L_P3L_MASK                                     0xFF

// Register: U3CON0
#define U3CON0 U3CON0
extern volatile unsigned char           U3CON0              __at(0x2D1);
#ifndef _LIB_BUILD
asm("U3CON0 equ 02D1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned U3MODE                 :4;
        unsigned U3RXEN                 :1;
        unsigned U3TXEN                 :1;
        unsigned U3ABDEN                :1;
        unsigned U3BRGS                 :1;
    };
    struct {
        unsigned U3MODE0                :1;
        unsigned U3MODE1                :1;
        unsigned U3MODE2                :1;
    };
    struct {
        unsigned MODE                   :4;
        unsigned RXEN                   :1;
        unsigned TXEN                   :1;
        unsigned ABDEN                  :1;
        unsigned BRGS                   :1;
    };
} U3CON0bits_t;
extern volatile U3CON0bits_t U3CON0bits __at(0x2D1);
// bitfield macros
#define _U3CON0_MODE0_POSN                                  0x0
#define _U3CON0_MODE0_POSITION                              0x0
#define _U3CON0_MODE0_SIZE                                  0x1
#define _U3CON0_MODE0_LENGTH                                0x1
#define _U3CON0_MODE0_MASK                                  0x1
#define _U3CON0_MODE1_POSN                                  0x1
#define _U3CON0_MODE1_POSITION                              0x1
#define _U3CON0_MODE1_SIZE                                  0x1
#define _U3CON0_MODE1_LENGTH                                0x1
#define _U3CON0_MODE1_MASK                                  0x2
#define _U3CON0_MODE2_POSN                                  0x2
#define _U3CON0_MODE2_POSITION                              0x2
#define _U3CON0_MODE2_SIZE                                  0x1
#define _U3CON0_MODE2_LENGTH                                0x1
#define _U3CON0_MODE2_MASK                                  0x4
#define _U3CON0_U3MODE_POSN                                 0x0
#define _U3CON0_U3MODE_POSITION                             0x0
#define _U3CON0_U3MODE_SIZE                                 0x4
#define _U3CON0_U3MODE_LENGTH                               0x4
#define _U3CON0_U3MODE_MASK                                 0xF
#define _U3CON0_U3RXEN_POSN                                 0x4
#define _U3CON0_U3RXEN_POSITION                             0x4
#define _U3CON0_U3RXEN_SIZE                                 0x1
#define _U3CON0_U3RXEN_LENGTH                               0x1
#define _U3CON0_U3RXEN_MASK                                 0x10
#define _U3CON0_U3TXEN_POSN                                 0x5
#define _U3CON0_U3TXEN_POSITION                             0x5
#define _U3CON0_U3TXEN_SIZE                                 0x1
#define _U3CON0_U3TXEN_LENGTH                               0x1
#define _U3CON0_U3TXEN_MASK                                 0x20
#define _U3CON0_U3ABDEN_POSN                                0x6
#define _U3CON0_U3ABDEN_POSITION                            0x6
#define _U3CON0_U3ABDEN_SIZE                                0x1
#define _U3CON0_U3ABDEN_LENGTH                              0x1
#define _U3CON0_U3ABDEN_MASK                                0x40
#define _U3CON0_U3BRGS_POSN                                 0x7
#define _U3CON0_U3BRGS_POSITION                             0x7
#define _U3CON0_U3BRGS_SIZE                                 0x1
#define _U3CON0_U3BRGS_LENGTH                               0x1
#define _U3CON0_U3BRGS_MASK                                 0x80
#define _U3CON0_U3MODE0_POSN                                0x0
#define _U3CON0_U3MODE0_POSITION                            0x0
#define _U3CON0_U3MODE0_SIZE                                0x1
#define _U3CON0_U3MODE0_LENGTH                              0x1
#define _U3CON0_U3MODE0_MASK                                0x1
#define _U3CON0_U3MODE1_POSN                                0x1
#define _U3CON0_U3MODE1_POSITION                            0x1
#define _U3CON0_U3MODE1_SIZE                                0x1
#define _U3CON0_U3MODE1_LENGTH                              0x1
#define _U3CON0_U3MODE1_MASK                                0x2
#define _U3CON0_U3MODE2_POSN                                0x2
#define _U3CON0_U3MODE2_POSITION                            0x2
#define _U3CON0_U3MODE2_SIZE                                0x1
#define _U3CON0_U3MODE2_LENGTH                              0x1
#define _U3CON0_U3MODE2_MASK                                0x4
#define _U3CON0_MODE_POSN                                   0x0
#define _U3CON0_MODE_POSITION                               0x0
#define _U3CON0_MODE_SIZE                                   0x4
#define _U3CON0_MODE_LENGTH                                 0x4
#define _U3CON0_MODE_MASK                                   0xF
#define _U3CON0_RXEN_POSN                                   0x4
#define _U3CON0_RXEN_POSITION                               0x4
#define _U3CON0_RXEN_SIZE                                   0x1
#define _U3CON0_RXEN_LENGTH                                 0x1
#define _U3CON0_RXEN_MASK                                   0x10
#define _U3CON0_TXEN_POSN                                   0x5
#define _U3CON0_TXEN_POSITION                               0x5
#define _U3CON0_TXEN_SIZE                                   0x1
#define _U3CON0_TXEN_LENGTH                                 0x1
#define _U3CON0_TXEN_MASK                                   0x20
#define _U3CON0_ABDEN_POSN                                  0x6
#define _U3CON0_ABDEN_POSITION                              0x6
#define _U3CON0_ABDEN_SIZE                                  0x1
#define _U3CON0_ABDEN_LENGTH                                0x1
#define _U3CON0_ABDEN_MASK                                  0x40
#define _U3CON0_BRGS_POSN                                   0x7
#define _U3CON0_BRGS_POSITION                               0x7
#define _U3CON0_BRGS_SIZE                                   0x1
#define _U3CON0_BRGS_LENGTH                                 0x1
#define _U3CON0_BRGS_MASK                                   0x80

// Register: U3CON1
#define U3CON1 U3CON1
extern volatile unsigned char           U3CON1              __at(0x2D2);
#ifndef _LIB_BUILD
asm("U3CON1 equ 02D2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U3SENDB                :1;
        unsigned U3BRKOVR               :1;
        unsigned                        :1;
        unsigned U3RXBIMD               :1;
        unsigned U3WUE                  :1;
        unsigned                        :2;
        unsigned U3ON                   :1;
    };
} U3CON1bits_t;
extern volatile U3CON1bits_t U3CON1bits __at(0x2D2);
// bitfield macros
#define _U3CON1_SENDB_POSN                                  0x0
#define _U3CON1_SENDB_POSITION                              0x0
#define _U3CON1_SENDB_SIZE                                  0x1
#define _U3CON1_SENDB_LENGTH                                0x1
#define _U3CON1_SENDB_MASK                                  0x1
#define _U3CON1_BRKOVR_POSN                                 0x1
#define _U3CON1_BRKOVR_POSITION                             0x1
#define _U3CON1_BRKOVR_SIZE                                 0x1
#define _U3CON1_BRKOVR_LENGTH                               0x1
#define _U3CON1_BRKOVR_MASK                                 0x2
#define _U3CON1_RXBIMD_POSN                                 0x3
#define _U3CON1_RXBIMD_POSITION                             0x3
#define _U3CON1_RXBIMD_SIZE                                 0x1
#define _U3CON1_RXBIMD_LENGTH                               0x1
#define _U3CON1_RXBIMD_MASK                                 0x8
#define _U3CON1_WUE_POSN                                    0x4
#define _U3CON1_WUE_POSITION                                0x4
#define _U3CON1_WUE_SIZE                                    0x1
#define _U3CON1_WUE_LENGTH                                  0x1
#define _U3CON1_WUE_MASK                                    0x10
#define _U3CON1_ON_POSN                                     0x7
#define _U3CON1_ON_POSITION                                 0x7
#define _U3CON1_ON_SIZE                                     0x1
#define _U3CON1_ON_LENGTH                                   0x1
#define _U3CON1_ON_MASK                                     0x80
#define _U3CON1_U3SENDB_POSN                                0x0
#define _U3CON1_U3SENDB_POSITION                            0x0
#define _U3CON1_U3SENDB_SIZE                                0x1
#define _U3CON1_U3SENDB_LENGTH                              0x1
#define _U3CON1_U3SENDB_MASK                                0x1
#define _U3CON1_U3BRKOVR_POSN                               0x1
#define _U3CON1_U3BRKOVR_POSITION                           0x1
#define _U3CON1_U3BRKOVR_SIZE                               0x1
#define _U3CON1_U3BRKOVR_LENGTH                             0x1
#define _U3CON1_U3BRKOVR_MASK                               0x2
#define _U3CON1_U3RXBIMD_POSN                               0x3
#define _U3CON1_U3RXBIMD_POSITION                           0x3
#define _U3CON1_U3RXBIMD_SIZE                               0x1
#define _U3CON1_U3RXBIMD_LENGTH                             0x1
#define _U3CON1_U3RXBIMD_MASK                               0x8
#define _U3CON1_U3WUE_POSN                                  0x4
#define _U3CON1_U3WUE_POSITION                              0x4
#define _U3CON1_U3WUE_SIZE                                  0x1
#define _U3CON1_U3WUE_LENGTH                                0x1
#define _U3CON1_U3WUE_MASK                                  0x10
#define _U3CON1_U3ON_POSN                                   0x7
#define _U3CON1_U3ON_POSITION                               0x7
#define _U3CON1_U3ON_SIZE                                   0x1
#define _U3CON1_U3ON_LENGTH                                 0x1
#define _U3CON1_U3ON_MASK                                   0x80

// Register: U3CON2
#define U3CON2 U3CON2
extern volatile unsigned char           U3CON2              __at(0x2D3);
#ifndef _LIB_BUILD
asm("U3CON2 equ 02D3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLO                    :2;
        unsigned TXPOL                  :1;
        unsigned                        :1;
        unsigned STP                    :2;
        unsigned RXPOL                  :1;
        unsigned RUNOVF                 :1;
    };
    struct {
        unsigned FLO0                   :1;
        unsigned FLO1                   :1;
        unsigned                        :2;
        unsigned STP0                   :1;
        unsigned STP1                   :1;
    };
    struct {
        unsigned U3FLO                  :2;
        unsigned U3TXPOL                :1;
        unsigned                        :1;
        unsigned U3STP                  :2;
        unsigned U3RXPOL                :1;
        unsigned U3RUNOVF               :1;
    };
    struct {
        unsigned U3FLO0                 :1;
        unsigned U3FLO1                 :1;
        unsigned                        :2;
        unsigned U3STP0                 :1;
        unsigned U3STP1                 :1;
    };
} U3CON2bits_t;
extern volatile U3CON2bits_t U3CON2bits __at(0x2D3);
// bitfield macros
#define _U3CON2_FLO_POSN                                    0x0
#define _U3CON2_FLO_POSITION                                0x0
#define _U3CON2_FLO_SIZE                                    0x2
#define _U3CON2_FLO_LENGTH                                  0x2
#define _U3CON2_FLO_MASK                                    0x3
#define _U3CON2_TXPOL_POSN                                  0x2
#define _U3CON2_TXPOL_POSITION                              0x2
#define _U3CON2_TXPOL_SIZE                                  0x1
#define _U3CON2_TXPOL_LENGTH                                0x1
#define _U3CON2_TXPOL_MASK                                  0x4
#define _U3CON2_STP_POSN                                    0x4
#define _U3CON2_STP_POSITION                                0x4
#define _U3CON2_STP_SIZE                                    0x2
#define _U3CON2_STP_LENGTH                                  0x2
#define _U3CON2_STP_MASK                                    0x30
#define _U3CON2_RXPOL_POSN                                  0x6
#define _U3CON2_RXPOL_POSITION                              0x6
#define _U3CON2_RXPOL_SIZE                                  0x1
#define _U3CON2_RXPOL_LENGTH                                0x1
#define _U3CON2_RXPOL_MASK                                  0x40
#define _U3CON2_RUNOVF_POSN                                 0x7
#define _U3CON2_RUNOVF_POSITION                             0x7
#define _U3CON2_RUNOVF_SIZE                                 0x1
#define _U3CON2_RUNOVF_LENGTH                               0x1
#define _U3CON2_RUNOVF_MASK                                 0x80
#define _U3CON2_FLO0_POSN                                   0x0
#define _U3CON2_FLO0_POSITION                               0x0
#define _U3CON2_FLO0_SIZE                                   0x1
#define _U3CON2_FLO0_LENGTH                                 0x1
#define _U3CON2_FLO0_MASK                                   0x1
#define _U3CON2_FLO1_POSN                                   0x1
#define _U3CON2_FLO1_POSITION                               0x1
#define _U3CON2_FLO1_SIZE                                   0x1
#define _U3CON2_FLO1_LENGTH                                 0x1
#define _U3CON2_FLO1_MASK                                   0x2
#define _U3CON2_STP0_POSN                                   0x4
#define _U3CON2_STP0_POSITION                               0x4
#define _U3CON2_STP0_SIZE                                   0x1
#define _U3CON2_STP0_LENGTH                                 0x1
#define _U3CON2_STP0_MASK                                   0x10
#define _U3CON2_STP1_POSN                                   0x5
#define _U3CON2_STP1_POSITION                               0x5
#define _U3CON2_STP1_SIZE                                   0x1
#define _U3CON2_STP1_LENGTH                                 0x1
#define _U3CON2_STP1_MASK                                   0x20
#define _U3CON2_U3FLO_POSN                                  0x0
#define _U3CON2_U3FLO_POSITION                              0x0
#define _U3CON2_U3FLO_SIZE                                  0x2
#define _U3CON2_U3FLO_LENGTH                                0x2
#define _U3CON2_U3FLO_MASK                                  0x3
#define _U3CON2_U3TXPOL_POSN                                0x2
#define _U3CON2_U3TXPOL_POSITION                            0x2
#define _U3CON2_U3TXPOL_SIZE                                0x1
#define _U3CON2_U3TXPOL_LENGTH                              0x1
#define _U3CON2_U3TXPOL_MASK                                0x4
#define _U3CON2_U3STP_POSN                                  0x4
#define _U3CON2_U3STP_POSITION                              0x4
#define _U3CON2_U3STP_SIZE                                  0x2
#define _U3CON2_U3STP_LENGTH                                0x2
#define _U3CON2_U3STP_MASK                                  0x30
#define _U3CON2_U3RXPOL_POSN                                0x6
#define _U3CON2_U3RXPOL_POSITION                            0x6
#define _U3CON2_U3RXPOL_SIZE                                0x1
#define _U3CON2_U3RXPOL_LENGTH                              0x1
#define _U3CON2_U3RXPOL_MASK                                0x40
#define _U3CON2_U3RUNOVF_POSN                               0x7
#define _U3CON2_U3RUNOVF_POSITION                           0x7
#define _U3CON2_U3RUNOVF_SIZE                               0x1
#define _U3CON2_U3RUNOVF_LENGTH                             0x1
#define _U3CON2_U3RUNOVF_MASK                               0x80
#define _U3CON2_U3FLO0_POSN                                 0x0
#define _U3CON2_U3FLO0_POSITION                             0x0
#define _U3CON2_U3FLO0_SIZE                                 0x1
#define _U3CON2_U3FLO0_LENGTH                               0x1
#define _U3CON2_U3FLO0_MASK                                 0x1
#define _U3CON2_U3FLO1_POSN                                 0x1
#define _U3CON2_U3FLO1_POSITION                             0x1
#define _U3CON2_U3FLO1_SIZE                                 0x1
#define _U3CON2_U3FLO1_LENGTH                               0x1
#define _U3CON2_U3FLO1_MASK                                 0x2
#define _U3CON2_U3STP0_POSN                                 0x4
#define _U3CON2_U3STP0_POSITION                             0x4
#define _U3CON2_U3STP0_SIZE                                 0x1
#define _U3CON2_U3STP0_LENGTH                               0x1
#define _U3CON2_U3STP0_MASK                                 0x10
#define _U3CON2_U3STP1_POSN                                 0x5
#define _U3CON2_U3STP1_POSITION                             0x5
#define _U3CON2_U3STP1_SIZE                                 0x1
#define _U3CON2_U3STP1_LENGTH                               0x1
#define _U3CON2_U3STP1_MASK                                 0x20

