GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
// Register: SCANTRIG
#define SCANTRIG SCANTRIG
extern volatile unsigned char           SCANTRIG            __at(0x361);
#ifndef _LIB_BUILD
asm("SCANTRIG equ 0361h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TSEL                   :8;
    };
    struct {
        unsigned TSEL0                  :1;
        unsigned TSEL1                  :1;
        unsigned TSEL2                  :1;
        unsigned TSEL3                  :1;
        unsigned TSEL4                  :1;
    };
    struct {
        unsigned SCANTSEL               :8;
    };
} SCANTRIGbits_t;
extern volatile SCANTRIGbits_t SCANTRIGbits __at(0x361);
// bitfield macros
#define _SCANTRIG_TSEL_POSN                                 0x0
#define _SCANTRIG_TSEL_POSITION                             0x0
#define _SCANTRIG_TSEL_SIZE                                 0x8
#define _SCANTRIG_TSEL_LENGTH                               0x8
#define _SCANTRIG_TSEL_MASK                                 0xFF
#define _SCANTRIG_TSEL0_POSN                                0x0
#define _SCANTRIG_TSEL0_POSITION                            0x0
#define _SCANTRIG_TSEL0_SIZE                                0x1
#define _SCANTRIG_TSEL0_LENGTH                              0x1
#define _SCANTRIG_TSEL0_MASK                                0x1
#define _SCANTRIG_TSEL1_POSN                                0x1
#define _SCANTRIG_TSEL1_POSITION                            0x1
#define _SCANTRIG_TSEL1_SIZE                                0x1
#define _SCANTRIG_TSEL1_LENGTH                              0x1
#define _SCANTRIG_TSEL1_MASK                                0x2
#define _SCANTRIG_TSEL2_POSN                                0x2
#define _SCANTRIG_TSEL2_POSITION                            0x2
#define _SCANTRIG_TSEL2_SIZE                                0x1
#define _SCANTRIG_TSEL2_LENGTH                              0x1
#define _SCANTRIG_TSEL2_MASK                                0x4
#define _SCANTRIG_TSEL3_POSN                                0x3
#define _SCANTRIG_TSEL3_POSITION                            0x3
#define _SCANTRIG_TSEL3_SIZE                                0x1
#define _SCANTRIG_TSEL3_LENGTH                              0x1
#define _SCANTRIG_TSEL3_MASK                                0x8
#define _SCANTRIG_TSEL4_POSN                                0x4
#define _SCANTRIG_TSEL4_POSITION                            0x4
#define _SCANTRIG_TSEL4_SIZE                                0x1
#define _SCANTRIG_TSEL4_LENGTH                              0x1
#define _SCANTRIG_TSEL4_MASK                                0x10
#define _SCANTRIG_SCANTSEL_POSN                             0x0
#define _SCANTRIG_SCANTSEL_POSITION                         0x0
#define _SCANTRIG_SCANTSEL_SIZE                             0x8
#define _SCANTRIG_SCANTSEL_LENGTH                           0x8
#define _SCANTRIG_SCANTSEL_MASK                             0xFF

// Register: IPR0
#define IPR0 IPR0
extern volatile unsigned char           IPR0                __at(0x362);
#ifndef _LIB_BUILD
asm("IPR0 equ 0362h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIP                   :1;
        unsigned HLVDIP                 :1;
        unsigned OSFIP                  :1;
        unsigned CSWIP                  :1;
        unsigned                        :1;
        unsigned CLC1IP                 :1;
        unsigned                        :1;
        unsigned IOCIP                  :1;
    };
} IPR0bits_t;
extern volatile IPR0bits_t IPR0bits __at(0x362);
// bitfield macros
#define _IPR0_SWIP_POSN                                     0x0
#define _IPR0_SWIP_POSITION                                 0x0
#define _IPR0_SWIP_SIZE                                     0x1
#define _IPR0_SWIP_LENGTH                                   0x1
#define _IPR0_SWIP_MASK                                     0x1
#define _IPR0_HLVDIP_POSN                                   0x1
#define _IPR0_HLVDIP_POSITION                               0x1
#define _IPR0_HLVDIP_SIZE                                   0x1
#define _IPR0_HLVDIP_LENGTH                                 0x1
#define _IPR0_HLVDIP_MASK                                   0x2
#define _IPR0_OSFIP_POSN                                    0x2
#define _IPR0_OSFIP_POSITION                                0x2
#define _IPR0_OSFIP_SIZE                                    0x1
#define _IPR0_OSFIP_LENGTH                                  0x1
#define _IPR0_OSFIP_MASK                                    0x4
#define _IPR0_CSWIP_POSN                                    0x3
#define _IPR0_CSWIP_POSITION                                0x3
#define _IPR0_CSWIP_SIZE                                    0x1
#define _IPR0_CSWIP_LENGTH                                  0x1
#define _IPR0_CSWIP_MASK                                    0x8
#define _IPR0_CLC1IP_POSN                                   0x5
#define _IPR0_CLC1IP_POSITION                               0x5
#define _IPR0_CLC1IP_SIZE                                   0x1
#define _IPR0_CLC1IP_LENGTH                                 0x1
#define _IPR0_CLC1IP_MASK                                   0x20
#define _IPR0_IOCIP_POSN                                    0x7
#define _IPR0_IOCIP_POSITION                                0x7
#define _IPR0_IOCIP_SIZE                                    0x1
#define _IPR0_IOCIP_LENGTH                                  0x1
#define _IPR0_IOCIP_MASK                                    0x80

// Register: IPR1
#define IPR1 IPR1
extern volatile unsigned char           IPR1                __at(0x363);
#ifndef _LIB_BUILD
asm("IPR1 equ 0363h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IP                 :1;
        unsigned ZCDIP                  :1;
        unsigned ADIP                   :1;
        unsigned ACTIP                  :1;
        unsigned C1IP                   :1;
        unsigned SMT1IP                 :1;
        unsigned SMT1PRAIP              :1;
        unsigned SMT1PWAIP              :1;
    };
} IPR1bits_t;
