GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
// Register: NCO1INCU
#define NCO1INCU NCO1INCU
extern volatile unsigned char           NCO1INCU            __at(0x445);
#ifndef _LIB_BUILD
asm("NCO1INCU equ 0445h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :4;
    };
    struct {
        unsigned NCO1INC16              :1;
        unsigned NCO1INC17              :1;
        unsigned NCO1INC18              :1;
        unsigned NCO1INC19              :1;
    };
    struct {
        unsigned INC16                  :1;
        unsigned INC17                  :1;
        unsigned INC18                  :1;
        unsigned INC19                  :1;
    };
    struct {
        unsigned NCO1INC                :4;
    };
} NCO1INCUbits_t;
extern volatile NCO1INCUbits_t NCO1INCUbits __at(0x445);
// bitfield macros
#define _NCO1INCU_INC_POSN                                  0x0
#define _NCO1INCU_INC_POSITION                              0x0
#define _NCO1INCU_INC_SIZE                                  0x4
#define _NCO1INCU_INC_LENGTH                                0x4
#define _NCO1INCU_INC_MASK                                  0xF
#define _NCO1INCU_NCO1INC16_POSN                            0x0
#define _NCO1INCU_NCO1INC16_POSITION                        0x0
#define _NCO1INCU_NCO1INC16_SIZE                            0x1
#define _NCO1INCU_NCO1INC16_LENGTH                          0x1
#define _NCO1INCU_NCO1INC16_MASK                            0x1
#define _NCO1INCU_NCO1INC17_POSN                            0x1
#define _NCO1INCU_NCO1INC17_POSITION                        0x1
#define _NCO1INCU_NCO1INC17_SIZE                            0x1
#define _NCO1INCU_NCO1INC17_LENGTH                          0x1
#define _NCO1INCU_NCO1INC17_MASK                            0x2
#define _NCO1INCU_NCO1INC18_POSN                            0x2
#define _NCO1INCU_NCO1INC18_POSITION                        0x2
#define _NCO1INCU_NCO1INC18_SIZE                            0x1
#define _NCO1INCU_NCO1INC18_LENGTH                          0x1
#define _NCO1INCU_NCO1INC18_MASK                            0x4
#define _NCO1INCU_NCO1INC19_POSN                            0x3
#define _NCO1INCU_NCO1INC19_POSITION                        0x3
#define _NCO1INCU_NCO1INC19_SIZE                            0x1
#define _NCO1INCU_NCO1INC19_LENGTH                          0x1
#define _NCO1INCU_NCO1INC19_MASK                            0x8
#define _NCO1INCU_INC16_POSN                                0x0
#define _NCO1INCU_INC16_POSITION                            0x0
#define _NCO1INCU_INC16_SIZE                                0x1
#define _NCO1INCU_INC16_LENGTH                              0x1
#define _NCO1INCU_INC16_MASK                                0x1
#define _NCO1INCU_INC17_POSN                                0x1
#define _NCO1INCU_INC17_POSITION                            0x1
#define _NCO1INCU_INC17_SIZE                                0x1
#define _NCO1INCU_INC17_LENGTH                              0x1
#define _NCO1INCU_INC17_MASK                                0x2
#define _NCO1INCU_INC18_POSN                                0x2
#define _NCO1INCU_INC18_POSITION                            0x2
#define _NCO1INCU_INC18_SIZE                                0x1
#define _NCO1INCU_INC18_LENGTH                              0x1
#define _NCO1INCU_INC18_MASK                                0x4
#define _NCO1INCU_INC19_POSN                                0x3
#define _NCO1INCU_INC19_POSITION                            0x3
#define _NCO1INCU_INC19_SIZE                                0x1
#define _NCO1INCU_INC19_LENGTH                              0x1
#define _NCO1INCU_INC19_MASK                                0x8
#define _NCO1INCU_NCO1INC_POSN                              0x0
#define _NCO1INCU_NCO1INC_POSITION                          0x0
#define _NCO1INCU_NCO1INC_SIZE                              0x4
#define _NCO1INCU_NCO1INC_LENGTH                            0x4
#define _NCO1INCU_NCO1INC_MASK                              0xF

// Register: NCO1CON
#define NCO1CON NCO1CON
extern volatile unsigned char           NCO1CON             __at(0x446);
#ifndef _LIB_BUILD
asm("NCO1CON equ 0446h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PFM                    :1;
        unsigned                        :3;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NCO1PFM                :1;
        unsigned                        :3;
        unsigned NCO1POL                :1;
        unsigned NCO1OUT                :1;
        unsigned                        :1;
        unsigned NCO1EN                 :1;
    };
} NCO1CONbits_t;
extern volatile NCO1CONbits_t NCO1CONbits __at(0x446);
// bitfield macros
#define _NCO1CON_PFM_POSN                                   0x0
#define _NCO1CON_PFM_POSITION                               0x0
#define _NCO1CON_PFM_SIZE                                   0x1
#define _NCO1CON_PFM_LENGTH                                 0x1
#define _NCO1CON_PFM_MASK                                   0x1
#define _NCO1CON_POL_POSN                                   0x4
#define _NCO1CON_POL_POSITION                               0x4
#define _NCO1CON_POL_SIZE                                   0x1
#define _NCO1CON_POL_LENGTH                                 0x1
#define _NCO1CON_POL_MASK                                   0x10
#define _NCO1CON_OUT_POSN                                   0x5
#define _NCO1CON_OUT_POSITION                               0x5
#define _NCO1CON_OUT_SIZE                                   0x1
#define _NCO1CON_OUT_LENGTH                                 0x1
#define _NCO1CON_OUT_MASK                                   0x20
#define _NCO1CON_EN_POSN                                    0x7
#define _NCO1CON_EN_POSITION                                0x7
#define _NCO1CON_EN_SIZE                                    0x1
#define _NCO1CON_EN_LENGTH                                  0x1
#define _NCO1CON_EN_MASK                                    0x80
#define _NCO1CON_NCO1PFM_POSN                               0x0
#define _NCO1CON_NCO1PFM_POSITION                           0x0
#define _NCO1CON_NCO1PFM_SIZE                               0x1
#define _NCO1CON_NCO1PFM_LENGTH                             0x1
#define _NCO1CON_NCO1PFM_MASK                               0x1
#define _NCO1CON_NCO1POL_POSN                               0x4
#define _NCO1CON_NCO1POL_POSITION                           0x4
#define _NCO1CON_NCO1POL_SIZE                               0x1
#define _NCO1CON_NCO1POL_LENGTH                             0x1
#define _NCO1CON_NCO1POL_MASK                               0x10
#define _NCO1CON_NCO1OUT_POSN                               0x5
#define _NCO1CON_NCO1OUT_POSITION                           0x5
#define _NCO1CON_NCO1OUT_SIZE                               0x1
#define _NCO1CON_NCO1OUT_LENGTH                             0x1
#define _NCO1CON_NCO1OUT_MASK                               0x20
#define _NCO1CON_NCO1EN_POSN                                0x7
#define _NCO1CON_NCO1EN_POSITION                            0x7
#define _NCO1CON_NCO1EN_SIZE                                0x1
#define _NCO1CON_NCO1EN_LENGTH                              0x1
#define _NCO1CON_NCO1EN_MASK                                0x80

