GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
// Register: NCO2ACCL
#define NCO2ACCL NCO2ACCL
extern volatile unsigned char           NCO2ACCL            __at(0x448);
#ifndef _LIB_BUILD
asm("NCO2ACCL equ 0448h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO2ACC0               :1;
        unsigned NCO2ACC1               :1;
        unsigned NCO2ACC2               :1;
        unsigned NCO2ACC3               :1;
        unsigned NCO2ACC4               :1;
        unsigned NCO2ACC5               :1;
        unsigned NCO2ACC6               :1;
        unsigned NCO2ACC7               :1;
    };
    struct {
        unsigned ACC0                   :1;
        unsigned ACC1                   :1;
        unsigned ACC2                   :1;
        unsigned ACC3                   :1;
        unsigned ACC4                   :1;
        unsigned ACC5                   :1;
        unsigned ACC6                   :1;
        unsigned ACC7                   :1;
    };
    struct {
        unsigned NCO2ACC                :8;
    };
} NCO2ACCLbits_t;
extern volatile NCO2ACCLbits_t NCO2ACCLbits __at(0x448);
// bitfield macros
#define _NCO2ACCL_ACC_POSN                                  0x0
#define _NCO2ACCL_ACC_POSITION                              0x0
#define _NCO2ACCL_ACC_SIZE                                  0x8
#define _NCO2ACCL_ACC_LENGTH                                0x8
#define _NCO2ACCL_ACC_MASK                                  0xFF
#define _NCO2ACCL_NCO2ACC0_POSN                             0x0
#define _NCO2ACCL_NCO2ACC0_POSITION                         0x0
#define _NCO2ACCL_NCO2ACC0_SIZE                             0x1
#define _NCO2ACCL_NCO2ACC0_LENGTH                           0x1
#define _NCO2ACCL_NCO2ACC0_MASK                             0x1
#define _NCO2ACCL_NCO2ACC1_POSN                             0x1
#define _NCO2ACCL_NCO2ACC1_POSITION                         0x1
#define _NCO2ACCL_NCO2ACC1_SIZE                             0x1
#define _NCO2ACCL_NCO2ACC1_LENGTH                           0x1
#define _NCO2ACCL_NCO2ACC1_MASK                             0x2
#define _NCO2ACCL_NCO2ACC2_POSN                             0x2
#define _NCO2ACCL_NCO2ACC2_POSITION                         0x2
#define _NCO2ACCL_NCO2ACC2_SIZE                             0x1
#define _NCO2ACCL_NCO2ACC2_LENGTH                           0x1
#define _NCO2ACCL_NCO2ACC2_MASK                             0x4
#define _NCO2ACCL_NCO2ACC3_POSN                             0x3
#define _NCO2ACCL_NCO2ACC3_POSITION                         0x3
#define _NCO2ACCL_NCO2ACC3_SIZE                             0x1
#define _NCO2ACCL_NCO2ACC3_LENGTH                           0x1
#define _NCO2ACCL_NCO2ACC3_MASK                             0x8
#define _NCO2ACCL_NCO2ACC4_POSN                             0x4
#define _NCO2ACCL_NCO2ACC4_POSITION                         0x4
#define _NCO2ACCL_NCO2ACC4_SIZE                             0x1
#define _NCO2ACCL_NCO2ACC4_LENGTH                           0x1
#define _NCO2ACCL_NCO2ACC4_MASK                             0x10
#define _NCO2ACCL_NCO2ACC5_POSN                             0x5
#define _NCO2ACCL_NCO2ACC5_POSITION                         0x5
#define _NCO2ACCL_NCO2ACC5_SIZE                             0x1
#define _NCO2ACCL_NCO2ACC5_LENGTH                           0x1
#define _NCO2ACCL_NCO2ACC5_MASK                             0x20
#define _NCO2ACCL_NCO2ACC6_POSN                             0x6
#define _NCO2ACCL_NCO2ACC6_POSITION                         0x6
#define _NCO2ACCL_NCO2ACC6_SIZE                             0x1
#define _NCO2ACCL_NCO2ACC6_LENGTH                           0x1
#define _NCO2ACCL_NCO2ACC6_MASK                             0x40
#define _NCO2ACCL_NCO2ACC7_POSN                             0x7
#define _NCO2ACCL_NCO2ACC7_POSITION                         0x7
#define _NCO2ACCL_NCO2ACC7_SIZE                             0x1
#define _NCO2ACCL_NCO2ACC7_LENGTH                           0x1
#define _NCO2ACCL_NCO2ACC7_MASK                             0x80
#define _NCO2ACCL_ACC0_POSN                                 0x0
#define _NCO2ACCL_ACC0_POSITION                             0x0
#define _NCO2ACCL_ACC0_SIZE                                 0x1
#define _NCO2ACCL_ACC0_LENGTH                               0x1
#define _NCO2ACCL_ACC0_MASK                                 0x1
#define _NCO2ACCL_ACC1_POSN                                 0x1
#define _NCO2ACCL_ACC1_POSITION                             0x1
#define _NCO2ACCL_ACC1_SIZE                                 0x1
#define _NCO2ACCL_ACC1_LENGTH                               0x1
#define _NCO2ACCL_ACC1_MASK                                 0x2
#define _NCO2ACCL_ACC2_POSN                                 0x2
#define _NCO2ACCL_ACC2_POSITION                             0x2
#define _NCO2ACCL_ACC2_SIZE                                 0x1
#define _NCO2ACCL_ACC2_LENGTH                               0x1
#define _NCO2ACCL_ACC2_MASK                                 0x4
#define _NCO2ACCL_ACC3_POSN                                 0x3
#define _NCO2ACCL_ACC3_POSITION                             0x3
#define _NCO2ACCL_ACC3_SIZE                                 0x1
#define _NCO2ACCL_ACC3_LENGTH                               0x1
#define _NCO2ACCL_ACC3_MASK                                 0x8
#define _NCO2ACCL_ACC4_POSN                                 0x4
#define _NCO2ACCL_ACC4_POSITION                             0x4
#define _NCO2ACCL_ACC4_SIZE                                 0x1
#define _NCO2ACCL_ACC4_LENGTH                               0x1
#define _NCO2ACCL_ACC4_MASK                                 0x10
#define _NCO2ACCL_ACC5_POSN                                 0x5
#define _NCO2ACCL_ACC5_POSITION                             0x5
#define _NCO2ACCL_ACC5_SIZE                                 0x1
#define _NCO2ACCL_ACC5_LENGTH                               0x1
#define _NCO2ACCL_ACC5_MASK                                 0x20
#define _NCO2ACCL_ACC6_POSN                                 0x6
#define _NCO2ACCL_ACC6_POSITION                             0x6
#define _NCO2ACCL_ACC6_SIZE                                 0x1
#define _NCO2ACCL_ACC6_LENGTH                               0x1
#define _NCO2ACCL_ACC6_MASK                                 0x40
#define _NCO2ACCL_ACC7_POSN                                 0x7
#define _NCO2ACCL_ACC7_POSITION                             0x7
#define _NCO2ACCL_ACC7_SIZE                                 0x1
#define _NCO2ACCL_ACC7_LENGTH                               0x1
#define _NCO2ACCL_ACC7_MASK                                 0x80
#define _NCO2ACCL_NCO2ACC_POSN                              0x0
#define _NCO2ACCL_NCO2ACC_POSITION                          0x0
#define _NCO2ACCL_NCO2ACC_SIZE                              0x8
#define _NCO2ACCL_NCO2ACC_LENGTH                            0x8
#define _NCO2ACCL_NCO2ACC_MASK                              0xFF

// Register: NCO2ACCH
#define NCO2ACCH NCO2ACCH
extern volatile unsigned char           NCO2ACCH            __at(0x449);
#ifndef _LIB_BUILD
asm("NCO2ACCH equ 0449h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO2ACC8               :1;
        unsigned NCO2ACC9               :1;
        unsigned NCO2ACC10              :1;
        unsigned NCO2ACC11              :1;
        unsigned NCO2ACC12              :1;
        unsigned NCO2ACC13              :1;
        unsigned NCO2ACC14              :1;
        unsigned NCO2ACC15              :1;
    };
    struct {
        unsigned ACC8                   :1;
        unsigned ACC9                   :1;
        unsigned ACC10                  :1;
        unsigned ACC11                  :1;
        unsigned ACC12                  :1;
        unsigned ACC13                  :1;
        unsigned ACC14                  :1;
        unsigned ACC15                  :1;
    };
    struct {
        unsigned NCO2ACC                :8;
    };
} NCO2ACCHbits_t;
extern volatile NCO2ACCHbits_t NCO2ACCHbits __at(0x449);
// bitfield macros
#define _NCO2ACCH_ACC_POSN                                  0x0
#define _NCO2ACCH_ACC_POSITION                              0x0
#define _NCO2ACCH_ACC_SIZE                                  0x8
#define _NCO2ACCH_ACC_LENGTH                                0x8
#define _NCO2ACCH_ACC_MASK                                  0xFF
#define _NCO2ACCH_NCO2ACC8_POSN                             0x0
#define _NCO2ACCH_NCO2ACC8_POSITION                         0x0
#define _NCO2ACCH_NCO2ACC8_SIZE                             0x1
#define _NCO2ACCH_NCO2ACC8_LENGTH                           0x1
#define _NCO2ACCH_NCO2ACC8_MASK                             0x1
#define _NCO2ACCH_NCO2ACC9_POSN                             0x1
#define _NCO2ACCH_NCO2ACC9_POSITION                         0x1
#define _NCO2ACCH_NCO2ACC9_SIZE                             0x1
#define _NCO2ACCH_NCO2ACC9_LENGTH                           0x1
#define _NCO2ACCH_NCO2ACC9_MASK                             0x2
#define _NCO2ACCH_NCO2ACC10_POSN                            0x2
#define _NCO2ACCH_NCO2ACC10_POSITION                        0x2
#define _NCO2ACCH_NCO2ACC10_SIZE                            0x1
#define _NCO2ACCH_NCO2ACC10_LENGTH                          0x1
#define _NCO2ACCH_NCO2ACC10_MASK                            0x4
#define _NCO2ACCH_NCO2ACC11_POSN                            0x3
#define _NCO2ACCH_NCO2ACC11_POSITION                        0x3
#define _NCO2ACCH_NCO2ACC11_SIZE                            0x1
#define _NCO2ACCH_NCO2ACC11_LENGTH                          0x1
#define _NCO2ACCH_NCO2ACC11_MASK                            0x8
#define _NCO2ACCH_NCO2ACC12_POSN                            0x4
#define _NCO2ACCH_NCO2ACC12_POSITION                        0x4
#define _NCO2ACCH_NCO2ACC12_SIZE                            0x1
#define _NCO2ACCH_NCO2ACC12_LENGTH                          0x1
#define _NCO2ACCH_NCO2ACC12_MASK                            0x10
#define _NCO2ACCH_NCO2ACC13_POSN                            0x5
#define _NCO2ACCH_NCO2ACC13_POSITION                        0x5
#define _NCO2ACCH_NCO2ACC13_SIZE                            0x1
#define _NCO2ACCH_NCO2ACC13_LENGTH                          0x1
#define _NCO2ACCH_NCO2ACC13_MASK                            0x20
#define _NCO2ACCH_NCO2ACC14_POSN                            0x6
#define _NCO2ACCH_NCO2ACC14_POSITION                        0x6
#define _NCO2ACCH_NCO2ACC14_SIZE                            0x1
#define _NCO2ACCH_NCO2ACC14_LENGTH                          0x1
#define _NCO2ACCH_NCO2ACC14_MASK                            0x40
#define _NCO2ACCH_NCO2ACC15_POSN                            0x7
#define _NCO2ACCH_NCO2ACC15_POSITION                        0x7
#define _NCO2ACCH_NCO2ACC15_SIZE                            0x1
#define _NCO2ACCH_NCO2ACC15_LENGTH                          0x1
#define _NCO2ACCH_NCO2ACC15_MASK                            0x80
#define _NCO2ACCH_ACC8_POSN                                 0x0
#define _NCO2ACCH_ACC8_POSITION                             0x0
#define _NCO2ACCH_ACC8_SIZE                                 0x1
#define _NCO2ACCH_ACC8_LENGTH                               0x1
#define _NCO2ACCH_ACC8_MASK                                 0x1
#define _NCO2ACCH_ACC9_POSN                                 0x1
#define _NCO2ACCH_ACC9_POSITION                             0x1
#define _NCO2ACCH_ACC9_SIZE                                 0x1
#define _NCO2ACCH_ACC9_LENGTH                               0x1
#define _NCO2ACCH_ACC9_MASK                                 0x2
#define _NCO2ACCH_ACC10_POSN                                0x2
#define _NCO2ACCH_ACC10_POSITION                            0x2
#define _NCO2ACCH_ACC10_SIZE                                0x1
#define _NCO2ACCH_ACC10_LENGTH                              0x1
#define _NCO2ACCH_ACC10_MASK                                0x4
#define _NCO2ACCH_ACC11_POSN                                0x3
#define _NCO2ACCH_ACC11_POSITION                            0x3
#define _NCO2ACCH_ACC11_SIZE                                0x1
#define _NCO2ACCH_ACC11_LENGTH                              0x1
#define _NCO2ACCH_ACC11_MASK                                0x8
#define _NCO2ACCH_ACC12_POSN                                0x4
#define _NCO2ACCH_ACC12_POSITION                            0x4
#define _NCO2ACCH_ACC12_SIZE                                0x1
#define _NCO2ACCH_ACC12_LENGTH                              0x1
#define _NCO2ACCH_ACC12_MASK                                0x10
#define _NCO2ACCH_ACC13_POSN                                0x5
#define _NCO2ACCH_ACC13_POSITION                            0x5
#define _NCO2ACCH_ACC13_SIZE                                0x1
#define _NCO2ACCH_ACC13_LENGTH                              0x1
#define _NCO2ACCH_ACC13_MASK                                0x20
#define _NCO2ACCH_ACC14_POSN                                0x6
#define _NCO2ACCH_ACC14_POSITION                            0x6
#define _NCO2ACCH_ACC14_SIZE                                0x1
#define _NCO2ACCH_ACC14_LENGTH                              0x1
#define _NCO2ACCH_ACC14_MASK                                0x40
#define _NCO2ACCH_ACC15_POSN                                0x7
#define _NCO2ACCH_ACC15_POSITION                            0x7
#define _NCO2ACCH_ACC15_SIZE                                0x1
#define _NCO2ACCH_ACC15_LENGTH                              0x1
#define _NCO2ACCH_ACC15_MASK                                0x80
#define _NCO2ACCH_NCO2ACC_POSN                              0x0
#define _NCO2ACCH_NCO2ACC_POSITION                          0x0
#define _NCO2ACCH_NCO2ACC_SIZE                              0x8
#define _NCO2ACCH_NCO2ACC_LENGTH                            0x8
#define _NCO2ACCH_NCO2ACC_MASK                              0xFF

