GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
// Register: PIE11
#define PIE11 PIE11
extern volatile unsigned char           PIE11               __at(0x4A9);
#ifndef _LIB_BUILD
asm("PIE11 equ 04A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3IE                 :1;
        unsigned CLC6IE                 :1;
        unsigned CWG3IE                 :1;
        unsigned TMR4IE                 :1;
        unsigned DMA4SCNTIE             :1;
        unsigned DMA4DCNTIE             :1;
        unsigned DMA4ORIE               :1;
        unsigned DMA4AIE                :1;
    };
} PIE11bits_t;
extern volatile PIE11bits_t PIE11bits __at(0x4A9);
// bitfield macros
#define _PIE11_CCP3IE_POSN                                  0x0
#define _PIE11_CCP3IE_POSITION                              0x0
#define _PIE11_CCP3IE_SIZE                                  0x1
#define _PIE11_CCP3IE_LENGTH                                0x1
#define _PIE11_CCP3IE_MASK                                  0x1
#define _PIE11_CLC6IE_POSN                                  0x1
#define _PIE11_CLC6IE_POSITION                              0x1
#define _PIE11_CLC6IE_SIZE                                  0x1
#define _PIE11_CLC6IE_LENGTH                                0x1
#define _PIE11_CLC6IE_MASK                                  0x2
#define _PIE11_CWG3IE_POSN                                  0x2
#define _PIE11_CWG3IE_POSITION                              0x2
#define _PIE11_CWG3IE_SIZE                                  0x1
#define _PIE11_CWG3IE_LENGTH                                0x1
#define _PIE11_CWG3IE_MASK                                  0x4
#define _PIE11_TMR4IE_POSN                                  0x3
#define _PIE11_TMR4IE_POSITION                              0x3
#define _PIE11_TMR4IE_SIZE                                  0x1
#define _PIE11_TMR4IE_LENGTH                                0x1
#define _PIE11_TMR4IE_MASK                                  0x8
#define _PIE11_DMA4SCNTIE_POSN                              0x4
#define _PIE11_DMA4SCNTIE_POSITION                          0x4
#define _PIE11_DMA4SCNTIE_SIZE                              0x1
#define _PIE11_DMA4SCNTIE_LENGTH                            0x1
#define _PIE11_DMA4SCNTIE_MASK                              0x10
#define _PIE11_DMA4DCNTIE_POSN                              0x5
#define _PIE11_DMA4DCNTIE_POSITION                          0x5
#define _PIE11_DMA4DCNTIE_SIZE                              0x1
#define _PIE11_DMA4DCNTIE_LENGTH                            0x1
#define _PIE11_DMA4DCNTIE_MASK                              0x20
#define _PIE11_DMA4ORIE_POSN                                0x6
#define _PIE11_DMA4ORIE_POSITION                            0x6
#define _PIE11_DMA4ORIE_SIZE                                0x1
#define _PIE11_DMA4ORIE_LENGTH                              0x1
#define _PIE11_DMA4ORIE_MASK                                0x40
#define _PIE11_DMA4AIE_POSN                                 0x7
#define _PIE11_DMA4AIE_POSITION                             0x7
#define _PIE11_DMA4AIE_SIZE                                 0x1
#define _PIE11_DMA4AIE_LENGTH                               0x1
#define _PIE11_DMA4AIE_MASK                                 0x80

// Register: PIE12
#define PIE12 PIE12
extern volatile unsigned char           PIE12               __at(0x4AA);
#ifndef _LIB_BUILD
asm("PIE12 equ 04AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U4RXIE                 :1;
        unsigned U4TXIE                 :1;
        unsigned U4EIE                  :1;
        unsigned U4IE                   :1;
        unsigned DMA5SCNTIE             :1;
        unsigned DMA5DCNTIE             :1;
        unsigned DMA5ORIE               :1;
        unsigned DMA5AIE                :1;
    };
} PIE12bits_t;
extern volatile PIE12bits_t PIE12bits __at(0x4AA);
// bitfield macros
#define _PIE12_U4RXIE_POSN                                  0x0
#define _PIE12_U4RXIE_POSITION                              0x0
#define _PIE12_U4RXIE_SIZE                                  0x1
#define _PIE12_U4RXIE_LENGTH                                0x1
#define _PIE12_U4RXIE_MASK                                  0x1
#define _PIE12_U4TXIE_POSN                                  0x1
#define _PIE12_U4TXIE_POSITION                              0x1
#define _PIE12_U4TXIE_SIZE                                  0x1
#define _PIE12_U4TXIE_LENGTH                                0x1
#define _PIE12_U4TXIE_MASK                                  0x2
#define _PIE12_U4EIE_POSN                                   0x2
#define _PIE12_U4EIE_POSITION                               0x2
#define _PIE12_U4EIE_SIZE                                   0x1
#define _PIE12_U4EIE_LENGTH                                 0x1
#define _PIE12_U4EIE_MASK                                   0x4
#define _PIE12_U4IE_POSN                                    0x3
#define _PIE12_U4IE_POSITION                                0x3
#define _PIE12_U4IE_SIZE                                    0x1
#define _PIE12_U4IE_LENGTH                                  0x1
#define _PIE12_U4IE_MASK                                    0x8
#define _PIE12_DMA5SCNTIE_POSN                              0x4
#define _PIE12_DMA5SCNTIE_POSITION                          0x4
#define _PIE12_DMA5SCNTIE_SIZE                              0x1
#define _PIE12_DMA5SCNTIE_LENGTH                            0x1
#define _PIE12_DMA5SCNTIE_MASK                              0x10
#define _PIE12_DMA5DCNTIE_POSN                              0x5
#define _PIE12_DMA5DCNTIE_POSITION                          0x5
#define _PIE12_DMA5DCNTIE_SIZE                              0x1
#define _PIE12_DMA5DCNTIE_LENGTH                            0x1
#define _PIE12_DMA5DCNTIE_MASK                              0x20
#define _PIE12_DMA5ORIE_POSN                                0x6
#define _PIE12_DMA5ORIE_POSITION                            0x6
#define _PIE12_DMA5ORIE_SIZE                                0x1
#define _PIE12_DMA5ORIE_LENGTH                              0x1
#define _PIE12_DMA5ORIE_MASK                                0x40
#define _PIE12_DMA5AIE_POSN                                 0x7
#define _PIE12_DMA5AIE_POSITION                             0x7
#define _PIE12_DMA5AIE_SIZE                                 0x1
#define _PIE12_DMA5AIE_LENGTH                               0x1
#define _PIE12_DMA5AIE_MASK                                 0x80

