GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
extern volatile __bit                   CCP2MD              __at(0x329);	// @ (0x65 * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD5,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1A30);	// @ (0x346 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1A31);	// @ (0x346 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1A32);	// @ (0x346 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1A33);	// @ (0x346 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1A35);	// @ (0x346 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0x1280);	// @ (0x250 * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0x1281);	// @ (0x250 * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0x1282);	// @ (0x250 * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0x1283);	// @ (0x250 * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0x1284);	// @ (0x250 * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP2PPS<CCP2PPS5>
extern volatile __bit                   CCP2PPS5            __at(0x1285);	// @ (0x250 * 8 + 5)
#define                                 CCP2PPS5_bit        _BIT_ACCESS(CCP2PPS,5)
// CCP3CAP<CCP3CTS0>
extern volatile __bit                   CCP3CTS0            __at(0x1A58);	// @ (0x34B * 8 + 0)
#define                                 CCP3CTS0_bit        _BIT_ACCESS(CCP3CAP,0)
// CCP3CAP<CCP3CTS1>
extern volatile __bit                   CCP3CTS1            __at(0x1A59);	// @ (0x34B * 8 + 1)
#define                                 CCP3CTS1_bit        _BIT_ACCESS(CCP3CAP,1)
// CCP3CAP<CCP3CTS2>
extern volatile __bit                   CCP3CTS2            __at(0x1A5A);	// @ (0x34B * 8 + 2)
#define                                 CCP3CTS2_bit        _BIT_ACCESS(CCP3CAP,2)
// CCP3CAP<CCP3CTS3>
extern volatile __bit                   CCP3CTS3            __at(0x1A5B);	// @ (0x34B * 8 + 3)
#define                                 CCP3CTS3_bit        _BIT_ACCESS(CCP3CAP,3)
// CCP3CON<CCP3EN>
extern volatile __bit                   CCP3EN              __at(0x1A57);	// @ (0x34A * 8 + 7)
#define                                 CCP3EN_bit          _BIT_ACCESS(CCP3CON,7)
// CCP3CON<CCP3FMT>
extern volatile __bit                   CCP3FMT             __at(0x1A54);	// @ (0x34A * 8 + 4)
#define                                 CCP3FMT_bit         _BIT_ACCESS(CCP3CON,4)
// PIE11<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x2548);	// @ (0x4A9 * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE11,0)
// PIR11<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x25C8);	// @ (0x4B9 * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR11,0)
// IPR11<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x1B68);	// @ (0x36D * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR11,0)
// PMD5<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x32A);	// @ (0x65 * 8 + 2)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD5,2)
// CCP3CON<CCP3MODE0>
extern volatile __bit                   CCP3MODE0           __at(0x1A50);	// @ (0x34A * 8 + 0)
#define                                 CCP3MODE0_bit       _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3MODE1>
extern volatile __bit                   CCP3MODE1           __at(0x1A51);	// @ (0x34A * 8 + 1)
#define                                 CCP3MODE1_bit       _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3MODE2>
extern volatile __bit                   CCP3MODE2           __at(0x1A52);	// @ (0x34A * 8 + 2)
#define                                 CCP3MODE2_bit       _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3MODE3>
extern volatile __bit                   CCP3MODE3           __at(0x1A53);	// @ (0x34A * 8 + 3)
#define                                 CCP3MODE3_bit       _BIT_ACCESS(CCP3CON,3)
// CCP3CON<CCP3OUT>
extern volatile __bit                   CCP3OUT             __at(0x1A55);	// @ (0x34A * 8 + 5)
#define                                 CCP3OUT_bit         _BIT_ACCESS(CCP3CON,5)
// CCP3PPS<CCP3PPS0>
extern volatile __bit                   CCP3PPS0            __at(0x1288);	// @ (0x251 * 8 + 0)
#define                                 CCP3PPS0_bit        _BIT_ACCESS(CCP3PPS,0)
// CCP3PPS<CCP3PPS1>
extern volatile __bit                   CCP3PPS1            __at(0x1289);	// @ (0x251 * 8 + 1)
#define                                 CCP3PPS1_bit        _BIT_ACCESS(CCP3PPS,1)
// CCP3PPS<CCP3PPS2>
extern volatile __bit                   CCP3PPS2            __at(0x128A);	// @ (0x251 * 8 + 2)
#define                                 CCP3PPS2_bit        _BIT_ACCESS(CCP3PPS,2)
// CCP3PPS<CCP3PPS3>
extern volatile __bit                   CCP3PPS3            __at(0x128B);	// @ (0x251 * 8 + 3)
#define                                 CCP3PPS3_bit        _BIT_ACCESS(CCP3PPS,3)
// CCP3PPS<CCP3PPS4>
extern volatile __bit                   CCP3PPS4            __at(0x128C);	// @ (0x251 * 8 + 4)
#define                                 CCP3PPS4_bit        _BIT_ACCESS(CCP3PPS,4)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x1EBA);	// @ (0x3D7 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x1EBB);	// @ (0x3D7 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x570);	// @ (0xAE * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x571);	// @ (0xAE * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x572);	// @ (0xAE * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x573);	// @ (0xAE * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// MD1CARH<CH0>
extern volatile __bit                   CH0                 __at(0x370);	// @ (0x6E * 8 + 0)
#define                                 CH0_bit             _BIT_ACCESS(MD1CARH,0)
// MD1CARH<CH1>
extern volatile __bit                   CH1                 __at(0x371);	// @ (0x6E * 8 + 1)
#define                                 CH1_bit             _BIT_ACCESS(MD1CARH,1)
// MD1CARH<CH2>
extern volatile __bit                   CH2                 __at(0x372);	// @ (0x6E * 8 + 2)
#define                                 CH2_bit             _BIT_ACCESS(MD1CARH,2)
// MD1CARH<CH3>
extern volatile __bit                   CH3                 __at(0x373);	// @ (0x6E * 8 + 3)
#define                                 CH3_bit             _BIT_ACCESS(MD1CARH,3)
// MD1CARH<CH4>
extern volatile __bit                   CH4                 __at(0x374);	// @ (0x6E * 8 + 4)
#define                                 CH4_bit             _BIT_ACCESS(MD1CARH,4)
// MD1CON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x35D);	// @ (0x6B * 8 + 5)
#define                                 CHPOL_bit           _BIT_ACCESS(MD1CON1,5)
// MD1CON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x35C);	// @ (0x6B * 8 + 4)
#define                                 CHSYNC_bit          _BIT_ACCESS(MD1CON1,4)
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0x18DB);	// @ (0x31B * 8 + 3)
#define                                 CKPS3_bit           _BIT_ACCESS(T0CON1,3)
// MD1CARL<CL0>
extern volatile __bit                   CL0                 __at(0x368);	// @ (0x6D * 8 + 0)
#define                                 CL0_bit             _BIT_ACCESS(MD1CARL,0)
// MD1CARL<CL1>
extern volatile __bit                   CL1                 __at(0x369);	// @ (0x6D * 8 + 1)
#define                                 CL1_bit             _BIT_ACCESS(MD1CARL,1)
// MD1CARL<CL2>
extern volatile __bit                   CL2                 __at(0x36A);	// @ (0x6D * 8 + 2)
#define                                 CL2_bit             _BIT_ACCESS(MD1CARL,2)
// MD1CARL<CL3>
extern volatile __bit                   CL3                 __at(0x36B);	// @ (0x6D * 8 + 3)
#define                                 CL3_bit             _BIT_ACCESS(MD1CARL,3)
// MD1CARL<CL4>
extern volatile __bit                   CL4                 __at(0x36C);	// @ (0x6D * 8 + 4)
#define                                 CL4_bit             _BIT_ACCESS(MD1CARL,4)
// PIE0<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x24F5);	// @ (0x49E * 8 + 5)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE0,5)
// PIR0<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x2575);	// @ (0x4AE * 8 + 5)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR0,5)
// IPR0<CLC1IP>
extern volatile __bit                   CLC1IP              __at(0x1B15);	// @ (0x362 * 8 + 5)
#define                                 CLC1IP_bit          _BIT_ACCESS(IPR0,5)
// PMD7<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x338);	// @ (0x67 * 8 + 0)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD7,0)
// CLCDATA<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x6A0);	// @ (0xD4 * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// PIE6<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x2521);	// @ (0x4A4 * 8 + 1)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x25A1);	// @ (0x4B4 * 8 + 1)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<CLC2IP>
extern volatile __bit                   CLC2IP              __at(0x1B41);	// @ (0x368 * 8 + 1)
#define                                 CLC2IP_bit          _BIT_ACCESS(IPR6,1)
// PMD7<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x339);	// @ (0x67 * 8 + 1)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD7,1)
// CLCDATA<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x6A1);	// @ (0xD4 * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// PIE7<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x252D);	// @ (0x4A5 * 8 + 5)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE7,5)
// PIR7<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x25AD);	// @ (0x4B5 * 8 + 5)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR7,5)
// IPR7<CLC3IP>
extern volatile __bit                   CLC3IP              __at(0x1B4D);	// @ (0x369 * 8 + 5)
#define                                 CLC3IP_bit          _BIT_ACCESS(IPR7,5)
// PMD7<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD7,2)
// CLCDATA<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x6A2);	// @ (0xD4 * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// PIE9<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x253D);	// @ (0x4A7 * 8 + 5)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE9,5)
// PIR9<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x25BD);	// @ (0x4B7 * 8 + 5)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR9,5)
// IPR9<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x1B5D);	// @ (0x36B * 8 + 5)
#define                                 CLC4IP_bit          _BIT_ACCESS(IPR9,5)
// PMD7<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x33B);	// @ (0x67 * 8 + 3)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD7,3)
// CLCDATA<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x6A3);	// @ (0xD4 * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// PIE10<CLC5IE>
extern volatile __bit                   CLC5IE              __at(0x2541);	// @ (0x4A8 * 8 + 1)
#define                                 CLC5IE_bit          _BIT_ACCESS(PIE10,1)
// PIR10<CLC5IF>
extern volatile __bit                   CLC5IF              __at(0x25C1);	// @ (0x4B8 * 8 + 1)
#define                                 CLC5IF_bit          _BIT_ACCESS(PIR10,1)
// IPR10<CLC5IP>
extern volatile __bit                   CLC5IP              __at(0x1B61);	// @ (0x36C * 8 + 1)
#define                                 CLC5IP_bit          _BIT_ACCESS(IPR10,1)
// PMD7<CLC5MD>
extern volatile __bit                   CLC5MD              __at(0x33C);	// @ (0x67 * 8 + 4)
#define                                 CLC5MD_bit          _BIT_ACCESS(PMD7,4)
// CLCDATA<CLC5OUT>
extern volatile __bit                   CLC5OUT             __at(0x6A4);	// @ (0xD4 * 8 + 4)
#define                                 CLC5OUT_bit         _BIT_ACCESS(CLCDATA,4)
// PIE11<CLC6IE>
extern volatile __bit                   CLC6IE              __at(0x2549);	// @ (0x4A9 * 8 + 1)
#define                                 CLC6IE_bit          _BIT_ACCESS(PIE11,1)
// PIR11<CLC6IF>
extern volatile __bit                   CLC6IF              __at(0x25C9);	// @ (0x4B9 * 8 + 1)
#define                                 CLC6IF_bit          _BIT_ACCESS(PIR11,1)
// IPR11<CLC6IP>
extern volatile __bit                   CLC6IP              __at(0x1B69);	// @ (0x36D * 8 + 1)
#define                                 CLC6IP_bit          _BIT_ACCESS(IPR11,1)
// PMD7<CLC6MD>
extern volatile __bit                   CLC6MD              __at(0x33D);	// @ (0x67 * 8 + 5)
#define                                 CLC6MD_bit          _BIT_ACCESS(PMD7,5)
// CLCDATA<CLC6OUT>
extern volatile __bit                   CLC6OUT             __at(0x6A5);	// @ (0xD4 * 8 + 5)
#define                                 CLC6OUT_bit         _BIT_ACCESS(CLCDATA,5)
// PIE14<CLC7IE>
extern volatile __bit                   CLC7IE              __at(0x2561);	// @ (0x4AC * 8 + 1)
#define                                 CLC7IE_bit          _BIT_ACCESS(PIE14,1)
// PIR14<CLC7IF>
extern volatile __bit                   CLC7IF              __at(0x25E1);	// @ (0x4BC * 8 + 1)
#define                                 CLC7IF_bit          _BIT_ACCESS(PIR14,1)
// IPR14<CLC7IP>
extern volatile __bit                   CLC7IP              __at(0x1B81);	// @ (0x370 * 8 + 1)
#define                                 CLC7IP_bit          _BIT_ACCESS(IPR14,1)
// PMD7<CLC7MD>
extern volatile __bit                   CLC7MD              __at(0x33E);	// @ (0x67 * 8 + 6)
#define                                 CLC7MD_bit          _BIT_ACCESS(PMD7,6)
// CLCDATA<CLC7OUT>
extern volatile __bit                   CLC7OUT             __at(0x6A6);	// @ (0xD4 * 8 + 6)
#define                                 CLC7OUT_bit         _BIT_ACCESS(CLCDATA,6)
// PIE15<CLC8IE>
extern volatile __bit                   CLC8IE              __at(0x2569);	// @ (0x4AD * 8 + 1)
#define                                 CLC8IE_bit          _BIT_ACCESS(PIE15,1)
// PIR15<CLC8IF>
extern volatile __bit                   CLC8IF              __at(0x25E9);	// @ (0x4BD * 8 + 1)
#define                                 CLC8IF_bit          _BIT_ACCESS(PIR15,1)
// IPR15<CLC8IP>
extern volatile __bit                   CLC8IP              __at(0x1B89);	// @ (0x371 * 8 + 1)
#define                                 CLC8IP_bit          _BIT_ACCESS(IPR15,1)
// PMD7<CLC8MD>
extern volatile __bit                   CLC8MD              __at(0x33F);	// @ (0x67 * 8 + 7)
#define                                 CLC8MD_bit          _BIT_ACCESS(PMD7,7)
// CLCDATA<CLC8OUT>
extern volatile __bit                   CLC8OUT             __at(0x6A7);	// @ (0xD4 * 8 + 7)
#define                                 CLC8OUT_bit         _BIT_ACCESS(CLCDATA,7)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0x1308);	// @ (0x261 * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0x1309);	// @ (0x261 * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0x130A);	// @ (0x261 * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0x130B);	// @ (0x261 * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0x130C);	// @ (0x261 * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0x1310);	// @ (0x262 * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0x1311);	// @ (0x262 * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0x1312);	// @ (0x262 * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0x1313);	// @ (0x262 * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0x1314);	// @ (0x262 * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0x1318);	// @ (0x263 * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0x1319);	// @ (0x263 * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0x131A);	// @ (0x263 * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0x131B);	// @ (0x263 * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0x131C);	// @ (0x263 * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0x1320);	// @ (0x264 * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0x1321);	// @ (0x264 * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0x1322);	// @ (0x264 * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0x1323);	// @ (0x264 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0x1324);	// @ (0x264 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLCIN4PPS<CLCIN4PPS0>
extern volatile __bit                   CLCIN4PPS0          __at(0x1328);	// @ (0x265 * 8 + 0)
#define                                 CLCIN4PPS0_bit      _BIT_ACCESS(CLCIN4PPS,0)
// CLCIN4PPS<CLCIN4PPS1>
extern volatile __bit                   CLCIN4PPS1          __at(0x1329);	// @ (0x265 * 8 + 1)
#define                                 CLCIN4PPS1_bit      _BIT_ACCESS(CLCIN4PPS,1)
// CLCIN4PPS<CLCIN4PPS2>
extern volatile __bit                   CLCIN4PPS2          __at(0x132A);	// @ (0x265 * 8 + 2)
#define                                 CLCIN4PPS2_bit      _BIT_ACCESS(CLCIN4PPS,2)
// CLCIN4PPS<CLCIN4PPS3>
extern volatile __bit                   CLCIN4PPS3          __at(0x132B);	// @ (0x265 * 8 + 3)
#define                                 CLCIN4PPS3_bit      _BIT_ACCESS(CLCIN4PPS,3)
// CLCIN4PPS<CLCIN4PPS4>
extern volatile __bit                   CLCIN4PPS4          __at(0x132C);	// @ (0x265 * 8 + 4)
#define                                 CLCIN4PPS4_bit      _BIT_ACCESS(CLCIN4PPS,4)
// CLCIN5PPS<CLCIN5PPS0>
extern volatile __bit                   CLCIN5PPS0          __at(0x1330);	// @ (0x266 * 8 + 0)
#define                                 CLCIN5PPS0_bit      _BIT_ACCESS(CLCIN5PPS,0)
// CLCIN5PPS<CLCIN5PPS1>
extern volatile __bit                   CLCIN5PPS1          __at(0x1331);	// @ (0x266 * 8 + 1)
#define                                 CLCIN5PPS1_bit      _BIT_ACCESS(CLCIN5PPS,1)
// CLCIN5PPS<CLCIN5PPS2>
extern volatile __bit                   CLCIN5PPS2          __at(0x1332);	// @ (0x266 * 8 + 2)
#define                                 CLCIN5PPS2_bit      _BIT_ACCESS(CLCIN5PPS,2)
// CLCIN5PPS<CLCIN5PPS3>
extern volatile __bit                   CLCIN5PPS3          __at(0x1333);	// @ (0x266 * 8 + 3)
#define                                 CLCIN5PPS3_bit      _BIT_ACCESS(CLCIN5PPS,3)
// CLCIN5PPS<CLCIN5PPS4>
extern volatile __bit                   CLCIN5PPS4          __at(0x1334);	// @ (0x266 * 8 + 4)
#define                                 CLCIN5PPS4_bit      _BIT_ACCESS(CLCIN5PPS,4)
// CLCIN6PPS<CLCIN6PPS0>
extern volatile __bit                   CLCIN6PPS0          __at(0x1338);	// @ (0x267 * 8 + 0)
