GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
#define                                 NCO2INC16_bit       _BIT_ACCESS(NCO2INCU,0)
// NCO2INCU<NCO2INC17>
extern volatile __bit                   NCO2INC17           __at(0x2269);	// @ (0x44D * 8 + 1)
#define                                 NCO2INC17_bit       _BIT_ACCESS(NCO2INCU,1)
// NCO2INCU<NCO2INC18>
extern volatile __bit                   NCO2INC18           __at(0x226A);	// @ (0x44D * 8 + 2)
#define                                 NCO2INC18_bit       _BIT_ACCESS(NCO2INCU,2)
// NCO2INCU<NCO2INC19>
extern volatile __bit                   NCO2INC19           __at(0x226B);	// @ (0x44D * 8 + 3)
#define                                 NCO2INC19_bit       _BIT_ACCESS(NCO2INCU,3)
// NCO2INCL<NCO2INC2>
extern volatile __bit                   NCO2INC2            __at(0x225A);	// @ (0x44B * 8 + 2)
#define                                 NCO2INC2_bit        _BIT_ACCESS(NCO2INCL,2)
// NCO2INCL<NCO2INC3>
extern volatile __bit                   NCO2INC3            __at(0x225B);	// @ (0x44B * 8 + 3)
#define                                 NCO2INC3_bit        _BIT_ACCESS(NCO2INCL,3)
// NCO2INCL<NCO2INC4>
extern volatile __bit                   NCO2INC4            __at(0x225C);	// @ (0x44B * 8 + 4)
#define                                 NCO2INC4_bit        _BIT_ACCESS(NCO2INCL,4)
// NCO2INCL<NCO2INC5>
extern volatile __bit                   NCO2INC5            __at(0x225D);	// @ (0x44B * 8 + 5)
#define                                 NCO2INC5_bit        _BIT_ACCESS(NCO2INCL,5)
// NCO2INCL<NCO2INC6>
extern volatile __bit                   NCO2INC6            __at(0x225E);	// @ (0x44B * 8 + 6)
#define                                 NCO2INC6_bit        _BIT_ACCESS(NCO2INCL,6)
// NCO2INCL<NCO2INC7>
extern volatile __bit                   NCO2INC7            __at(0x225F);	// @ (0x44B * 8 + 7)
#define                                 NCO2INC7_bit        _BIT_ACCESS(NCO2INCL,7)
// NCO2INCH<NCO2INC8>
extern volatile __bit                   NCO2INC8            __at(0x2260);	// @ (0x44C * 8 + 0)
#define                                 NCO2INC8_bit        _BIT_ACCESS(NCO2INCH,0)
// NCO2INCH<NCO2INC9>
extern volatile __bit                   NCO2INC9            __at(0x2261);	// @ (0x44C * 8 + 1)
#define                                 NCO2INC9_bit        _BIT_ACCESS(NCO2INCH,1)
// IPR10<NCO2IP>
extern volatile __bit                   NCO2IP              __at(0x1B63);	// @ (0x36C * 8 + 3)
#define                                 NCO2IP_bit          _BIT_ACCESS(IPR10,3)
// PMD4<NCO2MD>
extern volatile __bit                   NCO2MD              __at(0x321);	// @ (0x64 * 8 + 1)
#define                                 NCO2MD_bit          _BIT_ACCESS(PMD4,1)
// NCO2CON<NCO2OUT>
extern volatile __bit                   NCO2OUT             __at(0x2275);	// @ (0x44E * 8 + 5)
#define                                 NCO2OUT_bit         _BIT_ACCESS(NCO2CON,5)
// NCO2CON<NCO2PFM>
extern volatile __bit                   NCO2PFM             __at(0x2270);	// @ (0x44E * 8 + 0)
#define                                 NCO2PFM_bit         _BIT_ACCESS(NCO2CON,0)
// NCO2CON<NCO2POL>
extern volatile __bit                   NCO2POL             __at(0x2274);	// @ (0x44E * 8 + 4)
#define                                 NCO2POL_bit         _BIT_ACCESS(NCO2CON,4)
// NCO2CLK<NCO2PWS0>
extern volatile __bit                   NCO2PWS0            __at(0x227D);	// @ (0x44F * 8 + 5)
#define                                 NCO2PWS0_bit        _BIT_ACCESS(NCO2CLK,5)
// NCO2CLK<NCO2PWS1>
extern volatile __bit                   NCO2PWS1            __at(0x227E);	// @ (0x44F * 8 + 6)
#define                                 NCO2PWS1_bit        _BIT_ACCESS(NCO2CLK,6)
// NCO2CLK<NCO2PWS2>
extern volatile __bit                   NCO2PWS2            __at(0x227F);	// @ (0x44F * 8 + 7)
#define                                 NCO2PWS2_bit        _BIT_ACCESS(NCO2CLK,7)
// NCO3ACCL<NCO3ACC0>
extern volatile __bit                   NCO3ACC0            __at(0x2280);	// @ (0x450 * 8 + 0)
#define                                 NCO3ACC0_bit        _BIT_ACCESS(NCO3ACCL,0)
// NCO3ACCL<NCO3ACC1>
extern volatile __bit                   NCO3ACC1            __at(0x2281);	// @ (0x450 * 8 + 1)
#define                                 NCO3ACC1_bit        _BIT_ACCESS(NCO3ACCL,1)
// NCO3ACCH<NCO3ACC10>
extern volatile __bit                   NCO3ACC10           __at(0x228A);	// @ (0x451 * 8 + 2)
#define                                 NCO3ACC10_bit       _BIT_ACCESS(NCO3ACCH,2)
// NCO3ACCH<NCO3ACC11>
extern volatile __bit                   NCO3ACC11           __at(0x228B);	// @ (0x451 * 8 + 3)
#define                                 NCO3ACC11_bit       _BIT_ACCESS(NCO3ACCH,3)
// NCO3ACCH<NCO3ACC12>
extern volatile __bit                   NCO3ACC12           __at(0x228C);	// @ (0x451 * 8 + 4)
#define                                 NCO3ACC12_bit       _BIT_ACCESS(NCO3ACCH,4)
// NCO3ACCH<NCO3ACC13>
extern volatile __bit                   NCO3ACC13           __at(0x228D);	// @ (0x451 * 8 + 5)
#define                                 NCO3ACC13_bit       _BIT_ACCESS(NCO3ACCH,5)
// NCO3ACCH<NCO3ACC14>
extern volatile __bit                   NCO3ACC14           __at(0x228E);	// @ (0x451 * 8 + 6)
#define                                 NCO3ACC14_bit       _BIT_ACCESS(NCO3ACCH,6)
// NCO3ACCH<NCO3ACC15>
extern volatile __bit                   NCO3ACC15           __at(0x228F);	// @ (0x451 * 8 + 7)
#define                                 NCO3ACC15_bit       _BIT_ACCESS(NCO3ACCH,7)
// NCO3ACCU<NCO3ACC16>
extern volatile __bit                   NCO3ACC16           __at(0x2290);	// @ (0x452 * 8 + 0)
#define                                 NCO3ACC16_bit       _BIT_ACCESS(NCO3ACCU,0)
// NCO3ACCU<NCO3ACC17>
extern volatile __bit                   NCO3ACC17           __at(0x2291);	// @ (0x452 * 8 + 1)
#define                                 NCO3ACC17_bit       _BIT_ACCESS(NCO3ACCU,1)
// NCO3ACCU<NCO3ACC18>
extern volatile __bit                   NCO3ACC18           __at(0x2292);	// @ (0x452 * 8 + 2)
#define                                 NCO3ACC18_bit       _BIT_ACCESS(NCO3ACCU,2)
// NCO3ACCU<NCO3ACC19>
extern volatile __bit                   NCO3ACC19           __at(0x2293);	// @ (0x452 * 8 + 3)
#define                                 NCO3ACC19_bit       _BIT_ACCESS(NCO3ACCU,3)
// NCO3ACCL<NCO3ACC2>
extern volatile __bit                   NCO3ACC2            __at(0x2282);	// @ (0x450 * 8 + 2)
#define                                 NCO3ACC2_bit        _BIT_ACCESS(NCO3ACCL,2)
// NCO3ACCL<NCO3ACC3>
extern volatile __bit                   NCO3ACC3            __at(0x2283);	// @ (0x450 * 8 + 3)
#define                                 NCO3ACC3_bit        _BIT_ACCESS(NCO3ACCL,3)
// NCO3ACCL<NCO3ACC4>
extern volatile __bit                   NCO3ACC4            __at(0x2284);	// @ (0x450 * 8 + 4)
#define                                 NCO3ACC4_bit        _BIT_ACCESS(NCO3ACCL,4)
// NCO3ACCL<NCO3ACC5>
extern volatile __bit                   NCO3ACC5            __at(0x2285);	// @ (0x450 * 8 + 5)
#define                                 NCO3ACC5_bit        _BIT_ACCESS(NCO3ACCL,5)
// NCO3ACCL<NCO3ACC6>
extern volatile __bit                   NCO3ACC6            __at(0x2286);	// @ (0x450 * 8 + 6)
#define                                 NCO3ACC6_bit        _BIT_ACCESS(NCO3ACCL,6)
// NCO3ACCL<NCO3ACC7>
extern volatile __bit                   NCO3ACC7            __at(0x2287);	// @ (0x450 * 8 + 7)
#define                                 NCO3ACC7_bit        _BIT_ACCESS(NCO3ACCL,7)
// NCO3ACCH<NCO3ACC8>
extern volatile __bit                   NCO3ACC8            __at(0x2288);	// @ (0x451 * 8 + 0)
#define                                 NCO3ACC8_bit        _BIT_ACCESS(NCO3ACCH,0)
// NCO3ACCH<NCO3ACC9>
extern volatile __bit                   NCO3ACC9            __at(0x2289);	// @ (0x451 * 8 + 1)
#define                                 NCO3ACC9_bit        _BIT_ACCESS(NCO3ACCH,1)
// NCO3CLK<NCO3CKS0>
extern volatile __bit                   NCO3CKS0            __at(0x22B8);	// @ (0x457 * 8 + 0)
#define                                 NCO3CKS0_bit        _BIT_ACCESS(NCO3CLK,0)
// NCO3CLK<NCO3CKS1>
extern volatile __bit                   NCO3CKS1            __at(0x22B9);	// @ (0x457 * 8 + 1)
#define                                 NCO3CKS1_bit        _BIT_ACCESS(NCO3CLK,1)
// NCO3CLK<NCO3CKS2>
extern volatile __bit                   NCO3CKS2            __at(0x22BA);	// @ (0x457 * 8 + 2)
#define                                 NCO3CKS2_bit        _BIT_ACCESS(NCO3CLK,2)
// NCO3CLK<NCO3CKS3>
extern volatile __bit                   NCO3CKS3            __at(0x22BB);	// @ (0x457 * 8 + 3)
#define                                 NCO3CKS3_bit        _BIT_ACCESS(NCO3CLK,3)
// NCO3CLK<NCO3CKS4>
extern volatile __bit                   NCO3CKS4            __at(0x22BC);	// @ (0x457 * 8 + 4)
#define                                 NCO3CKS4_bit        _BIT_ACCESS(NCO3CLK,4)
// NCO3CON<NCO3EN>
extern volatile __bit                   NCO3EN              __at(0x22B7);	// @ (0x456 * 8 + 7)
#define                                 NCO3EN_bit          _BIT_ACCESS(NCO3CON,7)
// PIE14<NCO3IE>
extern volatile __bit                   NCO3IE              __at(0x2563);	// @ (0x4AC * 8 + 3)
#define                                 NCO3IE_bit          _BIT_ACCESS(PIE14,3)
// PIR14<NCO3IF>
extern volatile __bit                   NCO3IF              __at(0x25E3);	// @ (0x4BC * 8 + 3)
#define                                 NCO3IF_bit          _BIT_ACCESS(PIR14,3)
// NCO3INCL<NCO3INC0>
extern volatile __bit                   NCO3INC0            __at(0x2298);	// @ (0x453 * 8 + 0)
#define                                 NCO3INC0_bit        _BIT_ACCESS(NCO3INCL,0)
// NCO3INCL<NCO3INC1>
extern volatile __bit                   NCO3INC1            __at(0x2299);	// @ (0x453 * 8 + 1)
#define                                 NCO3INC1_bit        _BIT_ACCESS(NCO3INCL,1)
// NCO3INCH<NCO3INC10>
extern volatile __bit                   NCO3INC10           __at(0x22A2);	// @ (0x454 * 8 + 2)
#define                                 NCO3INC10_bit       _BIT_ACCESS(NCO3INCH,2)
// NCO3INCH<NCO3INC11>
extern volatile __bit                   NCO3INC11           __at(0x22A3);	// @ (0x454 * 8 + 3)
#define                                 NCO3INC11_bit       _BIT_ACCESS(NCO3INCH,3)
// NCO3INCH<NCO3INC12>
extern volatile __bit                   NCO3INC12           __at(0x22A4);	// @ (0x454 * 8 + 4)
#define                                 NCO3INC12_bit       _BIT_ACCESS(NCO3INCH,4)
// NCO3INCH<NCO3INC13>
extern volatile __bit                   NCO3INC13           __at(0x22A5);	// @ (0x454 * 8 + 5)
#define                                 NCO3INC13_bit       _BIT_ACCESS(NCO3INCH,5)
// NCO3INCH<NCO3INC14>
extern volatile __bit                   NCO3INC14           __at(0x22A6);	// @ (0x454 * 8 + 6)
#define                                 NCO3INC14_bit       _BIT_ACCESS(NCO3INCH,6)
// NCO3INCH<NCO3INC15>
extern volatile __bit                   NCO3INC15           __at(0x22A7);	// @ (0x454 * 8 + 7)
#define                                 NCO3INC15_bit       _BIT_ACCESS(NCO3INCH,7)
// NCO3INCU<NCO3INC16>
extern volatile __bit                   NCO3INC16           __at(0x22A8);	// @ (0x455 * 8 + 0)
#define                                 NCO3INC16_bit       _BIT_ACCESS(NCO3INCU,0)
// NCO3INCU<NCO3INC17>
extern volatile __bit                   NCO3INC17           __at(0x22A9);	// @ (0x455 * 8 + 1)
#define                                 NCO3INC17_bit       _BIT_ACCESS(NCO3INCU,1)
// NCO3INCU<NCO3INC18>
extern volatile __bit                   NCO3INC18           __at(0x22AA);	// @ (0x455 * 8 + 2)
#define                                 NCO3INC18_bit       _BIT_ACCESS(NCO3INCU,2)
// NCO3INCU<NCO3INC19>
extern volatile __bit                   NCO3INC19           __at(0x22AB);	// @ (0x455 * 8 + 3)
#define                                 NCO3INC19_bit       _BIT_ACCESS(NCO3INCU,3)
// NCO3INCL<NCO3INC2>
extern volatile __bit                   NCO3INC2            __at(0x229A);	// @ (0x453 * 8 + 2)
#define                                 NCO3INC2_bit        _BIT_ACCESS(NCO3INCL,2)
// NCO3INCL<NCO3INC3>
extern volatile __bit                   NCO3INC3            __at(0x229B);	// @ (0x453 * 8 + 3)
#define                                 NCO3INC3_bit        _BIT_ACCESS(NCO3INCL,3)
// NCO3INCL<NCO3INC4>
extern volatile __bit                   NCO3INC4            __at(0x229C);	// @ (0x453 * 8 + 4)
#define                                 NCO3INC4_bit        _BIT_ACCESS(NCO3INCL,4)
// NCO3INCL<NCO3INC5>
extern volatile __bit                   NCO3INC5            __at(0x229D);	// @ (0x453 * 8 + 5)
#define                                 NCO3INC5_bit        _BIT_ACCESS(NCO3INCL,5)
// NCO3INCL<NCO3INC6>
extern volatile __bit                   NCO3INC6            __at(0x229E);	// @ (0x453 * 8 + 6)
#define                                 NCO3INC6_bit        _BIT_ACCESS(NCO3INCL,6)
// NCO3INCL<NCO3INC7>
extern volatile __bit                   NCO3INC7            __at(0x229F);	// @ (0x453 * 8 + 7)
#define                                 NCO3INC7_bit        _BIT_ACCESS(NCO3INCL,7)
// NCO3INCH<NCO3INC8>
extern volatile __bit                   NCO3INC8            __at(0x22A0);	// @ (0x454 * 8 + 0)
#define                                 NCO3INC8_bit        _BIT_ACCESS(NCO3INCH,0)
// NCO3INCH<NCO3INC9>
extern volatile __bit                   NCO3INC9            __at(0x22A1);	// @ (0x454 * 8 + 1)
#define                                 NCO3INC9_bit        _BIT_ACCESS(NCO3INCH,1)
// IPR14<NCO3IP>
extern volatile __bit                   NCO3IP              __at(0x1B83);	// @ (0x370 * 8 + 3)
#define                                 NCO3IP_bit          _BIT_ACCESS(IPR14,3)
// PMD4<NCO3MD>
extern volatile __bit                   NCO3MD              __at(0x322);	// @ (0x64 * 8 + 2)
#define                                 NCO3MD_bit          _BIT_ACCESS(PMD4,2)
// NCO3CON<NCO3OUT>
extern volatile __bit                   NCO3OUT             __at(0x22B5);	// @ (0x456 * 8 + 5)
#define                                 NCO3OUT_bit         _BIT_ACCESS(NCO3CON,5)
// NCO3CON<NCO3PFM>
extern volatile __bit                   NCO3PFM             __at(0x22B0);	// @ (0x456 * 8 + 0)
#define                                 NCO3PFM_bit         _BIT_ACCESS(NCO3CON,0)
// NCO3CON<NCO3POL>
extern volatile __bit                   NCO3POL             __at(0x22B4);	// @ (0x456 * 8 + 4)
#define                                 NCO3POL_bit         _BIT_ACCESS(NCO3CON,4)
// NCO3CLK<NCO3PWS0>
extern volatile __bit                   NCO3PWS0            __at(0x22BD);	// @ (0x457 * 8 + 5)
#define                                 NCO3PWS0_bit        _BIT_ACCESS(NCO3CLK,5)
// NCO3CLK<NCO3PWS1>
extern volatile __bit                   NCO3PWS1            __at(0x22BE);	// @ (0x457 * 8 + 6)
#define                                 NCO3PWS1_bit        _BIT_ACCESS(NCO3CLK,6)
// NCO3CLK<NCO3PWS2>
extern volatile __bit                   NCO3PWS2            __at(0x22BF);	// @ (0x457 * 8 + 7)
#define                                 NCO3PWS2_bit        _BIT_ACCESS(NCO3CLK,7)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x568);	// @ (0xAD * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x569);	// @ (0xAD * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x56A);	// @ (0xAD * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x56B);	// @ (0xAD * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x56C);	// @ (0xAD * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x56D);	// @ (0xAD * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x56E);	// @ (0xAD * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x57B);	// @ (0xAF * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// I2C1STAT0<NOT_A>
extern volatile __bit                   NOT_A               __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 NOT_A_bit           _BIT_ACCESS(I2C1STAT0,3)
// I2C1STAT0<NOT_ADDRESS>
extern volatile __bit                   NOT_ADDRESS         __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 NOT_ADDRESS_bit     _BIT_ACCESS(I2C1STAT0,3)
// PCON0<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(PCON0,0)
// PCON1<NOT_MEMV>
extern volatile __bit                   NOT_MEMV            __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 NOT_MEMV_bit        _BIT_ACCESS(PCON1,1)
// PCON0<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(PCON0,1)
// PCON1<NOT_RCM>
extern volatile __bit                   NOT_RCM             __at(0x2788);	// @ (0x4F1 * 8 + 0)
#define                                 NOT_RCM_bit         _BIT_ACCESS(PCON1,0)
// PCON0<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 NOT_RI_bit          _BIT_ACCESS(PCON0,2)
// PCON0<NOT_RMCLR>
extern volatile __bit                   NOT_RMCLR           __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 NOT_RMCLR_bit       _BIT_ACCESS(PCON0,3)
// PCON1<NOT_RVREG>
extern volatile __bit                   NOT_RVREG           __at(0x278A);	// @ (0x4F1 * 8 + 2)
#define                                 NOT_RVREG_bit       _BIT_ACCESS(PCON1,2)
// PCON0<NOT_RWDT>
extern volatile __bit                   NOT_RWDT            __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 NOT_RWDT_bit        _BIT_ACCESS(PCON0,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x18FB);	// @ (0x31F * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x18F2);	// @ (0x31E * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x195B);	// @ (0x32B * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x1952);	// @ (0x32A * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// T5GCON<NOT_T5DONE>
extern volatile __bit                   NOT_T5DONE          __at(0x19BB);	// @ (0x337 * 8 + 3)
#define                                 NOT_T5DONE_bit      _BIT_ACCESS(T5GCON,3)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x19B2);	// @ (0x336 * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// I2C1STAT0<NOT_W>
extern volatile __bit                   NOT_W               __at(0x14C4);	// @ (0x298 * 8 + 4)
#define                                 NOT_W_bit           _BIT_ACCESS(I2C1STAT0,4)
// PCON0<NOT_WDTWV>
extern volatile __bit                   NOT_WDTWV           __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 NOT_WDTWV_bit       _BIT_ACCESS(PCON0,5)
// I2C1STAT0<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x14C4);	// @ (0x298 * 8 + 4)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(I2C1STAT0,4)
// ADREF<NREF0>
extern volatile __bit                   NREF0               __at(0x1FC4);	// @ (0x3F8 * 8 + 4)
#define                                 NREF0_bit           _BIT_ACCESS(ADREF,4)
// DAC1CON<NSS0>
extern volatile __bit                   NSS0                __at(0x3F8);	// @ (0x7F * 8 + 0)
#define                                 NSS0_bit            _BIT_ACCESS(DAC1CON,0)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x218);	// @ (0x43 * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x219);	// @ (0x43 * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRH<NVMADR10>
extern volatile __bit                   NVMADR10            __at(0x222);	// @ (0x44 * 8 + 2)
#define                                 NVMADR10_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADR11>
extern volatile __bit                   NVMADR11            __at(0x223);	// @ (0x44 * 8 + 3)
#define                                 NVMADR11_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADR12>
extern volatile __bit                   NVMADR12            __at(0x224);	// @ (0x44 * 8 + 4)
#define                                 NVMADR12_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADR13>
extern volatile __bit                   NVMADR13            __at(0x225);	// @ (0x44 * 8 + 5)
#define                                 NVMADR13_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADR14>
extern volatile __bit                   NVMADR14            __at(0x226);	// @ (0x44 * 8 + 6)
#define                                 NVMADR14_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRH<NVMADR15>
extern volatile __bit                   NVMADR15            __at(0x227);	// @ (0x44 * 8 + 7)
#define                                 NVMADR15_bit        _BIT_ACCESS(NVMADRH,7)
// NVMADRU<NVMADR16>
extern volatile __bit                   NVMADR16            __at(0x228);	// @ (0x45 * 8 + 0)
#define                                 NVMADR16_bit        _BIT_ACCESS(NVMADRU,0)
// NVMADRU<NVMADR17>
extern volatile __bit                   NVMADR17            __at(0x229);	// @ (0x45 * 8 + 1)
#define                                 NVMADR17_bit        _BIT_ACCESS(NVMADRU,1)
// NVMADRU<NVMADR18>
extern volatile __bit                   NVMADR18            __at(0x22A);	// @ (0x45 * 8 + 2)
#define                                 NVMADR18_bit        _BIT_ACCESS(NVMADRU,2)
// NVMADRU<NVMADR19>
extern volatile __bit                   NVMADR19            __at(0x22B);	// @ (0x45 * 8 + 3)
#define                                 NVMADR19_bit        _BIT_ACCESS(NVMADRU,3)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x21A);	// @ (0x43 * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRU<NVMADR20>
extern volatile __bit                   NVMADR20            __at(0x22C);	// @ (0x45 * 8 + 4)
#define                                 NVMADR20_bit        _BIT_ACCESS(NVMADRU,4)
// NVMADRU<NVMADR21>
extern volatile __bit                   NVMADR21            __at(0x22D);	// @ (0x45 * 8 + 5)
#define                                 NVMADR21_bit        _BIT_ACCESS(NVMADRU,5)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x21B);	// @ (0x43 * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
