GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.h
extern volatile __bit                   NVMADR4             __at(0x21C);	// @ (0x43 * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x21D);	// @ (0x43 * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x21E);	// @ (0x43 * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x21F);	// @ (0x43 * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0x220);	// @ (0x44 * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0x221);	// @ (0x44 * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x230);	// @ (0x46 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x231);	// @ (0x46 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0x23A);	// @ (0x47 * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0x23B);	// @ (0x47 * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0x23C);	// @ (0x47 * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0x23D);	// @ (0x47 * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATH<NVMDAT14>
extern volatile __bit                   NVMDAT14            __at(0x23E);	// @ (0x47 * 8 + 6)
#define                                 NVMDAT14_bit        _BIT_ACCESS(NVMDATH,6)
// NVMDATH<NVMDAT15>
extern volatile __bit                   NVMDAT15            __at(0x23F);	// @ (0x47 * 8 + 7)
#define                                 NVMDAT15_bit        _BIT_ACCESS(NVMDATH,7)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x232);	// @ (0x46 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x233);	// @ (0x46 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x234);	// @ (0x46 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x235);	// @ (0x46 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x236);	// @ (0x46 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x237);	// @ (0x46 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0x238);	// @ (0x47 * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0x239);	// @ (0x47 * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// NVMCON0<NVMGO>
extern volatile __bit                   NVMGO               __at(0x200);	// @ (0x40 * 8 + 0)
#define                                 NVMGO_bit           _BIT_ACCESS(NVMCON0,0)
// PIE15<NVMIE>
extern volatile __bit                   NVMIE               __at(0x2568);	// @ (0x4AD * 8 + 0)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE15,0)
// PIR15<NVMIF>
extern volatile __bit                   NVMIF               __at(0x25E8);	// @ (0x4BD * 8 + 0)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR15,0)
// IPR15<NVMIP>
extern volatile __bit                   NVMIP               __at(0x1B88);	// @ (0x371 * 8 + 0)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR15,0)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x2010);	// @ (0x402 * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x2011);	// @ (0x402 * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x2012);	// @ (0x402 * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0x2013);	// @ (0x402 * 8 + 3)
#define                                 ODCA3_bit           _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x2014);	// @ (0x402 * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x2015);	// @ (0x402 * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0x2016);	// @ (0x402 * 8 + 6)
#define                                 ODCA6_bit           _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0x2017);	// @ (0x402 * 8 + 7)
#define                                 ODCA7_bit           _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0x2050);	// @ (0x40A * 8 + 0)
#define                                 ODCB0_bit           _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0x2051);	// @ (0x40A * 8 + 1)
#define                                 ODCB1_bit           _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0x2052);	// @ (0x40A * 8 + 2)
#define                                 ODCB2_bit           _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0x2053);	// @ (0x40A * 8 + 3)
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x2054);	// @ (0x40A * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x2055);	// @ (0x40A * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x2056);	// @ (0x40A * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x2057);	// @ (0x40A * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x2090);	// @ (0x412 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x2091);	// @ (0x412 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x2092);	// @ (0x412 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x2093);	// @ (0x412 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x2094);	// @ (0x412 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x2095);	// @ (0x412 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x2096);	// @ (0x412 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x2097);	// @ (0x412 * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// ODCOND<ODCD0>
extern volatile __bit                   ODCD0               __at(0x20D0);	// @ (0x41A * 8 + 0)
#define                                 ODCD0_bit           _BIT_ACCESS(ODCOND,0)
// ODCOND<ODCD1>
extern volatile __bit                   ODCD1               __at(0x20D1);	// @ (0x41A * 8 + 1)
#define                                 ODCD1_bit           _BIT_ACCESS(ODCOND,1)
// ODCOND<ODCD2>
extern volatile __bit                   ODCD2               __at(0x20D2);	// @ (0x41A * 8 + 2)
#define                                 ODCD2_bit           _BIT_ACCESS(ODCOND,2)
// ODCOND<ODCD3>
extern volatile __bit                   ODCD3               __at(0x20D3);	// @ (0x41A * 8 + 3)
#define                                 ODCD3_bit           _BIT_ACCESS(ODCOND,3)
// ODCOND<ODCD4>
extern volatile __bit                   ODCD4               __at(0x20D4);	// @ (0x41A * 8 + 4)
#define                                 ODCD4_bit           _BIT_ACCESS(ODCOND,4)
// ODCOND<ODCD5>
extern volatile __bit                   ODCD5               __at(0x20D5);	// @ (0x41A * 8 + 5)
#define                                 ODCD5_bit           _BIT_ACCESS(ODCOND,5)
// ODCOND<ODCD6>
extern volatile __bit                   ODCD6               __at(0x20D6);	// @ (0x41A * 8 + 6)
#define                                 ODCD6_bit           _BIT_ACCESS(ODCOND,6)
// ODCOND<ODCD7>
extern volatile __bit                   ODCD7               __at(0x20D7);	// @ (0x41A * 8 + 7)
#define                                 ODCD7_bit           _BIT_ACCESS(ODCOND,7)
// ODCONE<ODCE0>
extern volatile __bit                   ODCE0               __at(0x2110);	// @ (0x422 * 8 + 0)
#define                                 ODCE0_bit           _BIT_ACCESS(ODCONE,0)
// ODCONE<ODCE1>
extern volatile __bit                   ODCE1               __at(0x2111);	// @ (0x422 * 8 + 1)
#define                                 ODCE1_bit           _BIT_ACCESS(ODCONE,1)
// ODCONE<ODCE2>
extern volatile __bit                   ODCE2               __at(0x2112);	// @ (0x422 * 8 + 2)
#define                                 ODCE2_bit           _BIT_ACCESS(ODCONE,2)
// CLCnCON<OE>
extern volatile __bit                   OE                  __at(0x6B6);	// @ (0xD6 * 8 + 6)
#define                                 OE_bit              _BIT_ACCESS(CLCnCON,6)
// DAC1CON<OE0>
extern volatile __bit                   OE0                 __at(0x3FC);	// @ (0x7F * 8 + 4)
#define                                 OE0_bit             _BIT_ACCESS(DAC1CON,4)
// DAC1CON<OE1>
extern volatile __bit                   OE1                 __at(0x3FD);	// @ (0x7F * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON,5)
// MD1CON0<OPOL>
extern volatile __bit                   OPOL                __at(0x354);	// @ (0x6A * 8 + 4)
#define                                 OPOL_bit            _BIT_ACCESS(MD1CON0,4)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x57C);	// @ (0xAF * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// ACTCON<ORS>
extern volatile __bit                   ORS                 __at(0x561);	// @ (0xAC * 8 + 1)
#define                                 ORS_bit             _BIT_ACCESS(ACTCON,1)
// PIE0<OSFIE>
extern volatile __bit                   OSFIE               __at(0x24F2);	// @ (0x49E * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE0,2)
// PIR0<OSFIF>
extern volatile __bit                   OSFIF               __at(0x2572);	// @ (0x4AE * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR0,2)
// IPR0<OSFIP>
extern volatile __bit                   OSFIP               __at(0x1B12);	// @ (0x362 * 8 + 2)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR0,2)
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0x1530);	// @ (0x2A6 * 8 + 0)
#define                                 P1H_bit             _BIT_ACCESS(U1P1H,0)
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0x1540);	// @ (0x2A8 * 8 + 0)
#define                                 P2H_bit             _BIT_ACCESS(U1P2H,0)
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0x1550);	// @ (0x2AA * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// I2C1PIE<PCIE>
extern volatile __bit                   PCIE                __at(0x14DA);	// @ (0x29B * 8 + 2)
#define                                 PCIE_bit            _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PCIF>
extern volatile __bit                   PCIF                __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 PCIF_bit            _BIT_ACCESS(I2C1PIR,2)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1AC0);	// @ (0x358 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1AC1);	// @ (0x358 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1AC2);	// @ (0x358 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1AC3);	// @ (0x358 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// OSCEN<PLLEN>
extern volatile __bit                   PLLEN               __at(0x598);	// @ (0xB3 * 8 + 0)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCEN,0)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x590);	// @ (0xB2 * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// VREGCON<PMSYS0>
extern volatile __bit                   PMSYS0              __at(0x244);	// @ (0x48 * 8 + 4)
#define                                 PMSYS0_bit          _BIT_ACCESS(VREGCON,4)
// VREGCON<PMSYS1>
extern volatile __bit                   PMSYS1              __at(0x245);	// @ (0x48 * 8 + 5)
#define                                 PMSYS1_bit          _BIT_ACCESS(VREGCON,5)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// INT0PPS<PORT>
extern volatile __bit                   PORT                __at(0x11F3);	// @ (0x23E * 8 + 3)
#define                                 PORT_bit            _BIT_ACCESS(INT0PPS,3)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1FA7);	// @ (0x3F4 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1000);	// @ (0x200 * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x1F88);	// @ (0x3F1 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x1F89);	// @ (0x3F1 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x1F92);	// @ (0x3F2 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x1F93);	// @ (0x3F2 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x1F94);	// @ (0x3F2 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x1F8A);	// @ (0x3F1 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x1F8B);	// @ (0x3F1 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x1F8C);	// @ (0x3F1 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x1F8D);	// @ (0x3F1 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x1F8E);	// @ (0x3F1 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x1F8F);	// @ (0x3F1 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x1F90);	// @ (0x3F2 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x1F91);	// @ (0x3F2 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0x1FC0);	// @ (0x3F8 * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0x1FC1);	// @ (0x3F8 * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0x1F40);	// @ (0x3E8 * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0x1F41);	// @ (0x3E8 * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0x1F4A);	// @ (0x3E9 * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0x1F4B);	// @ (0x3E9 * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0x1F4C);	// @ (0x3E9 * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0x1F4D);	// @ (0x3E9 * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0x1F4E);	// @ (0x3E9 * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0x1F4F);	// @ (0x3E9 * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0x1F42);	// @ (0x3E8 * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0x1F43);	// @ (0x3E8 * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0x1F44);	// @ (0x3E8 * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0x1F45);	// @ (0x3E8 * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0x1F46);	// @ (0x3E8 * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0x1F47);	// @ (0x3E8 * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0x1F48);	// @ (0x3E9 * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0x1F49);	// @ (0x3E9 * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// PRLOCK<PRLOCKED>
extern volatile __bit                   PRLOCKED            __at(0x5A0);	// @ (0xB4 * 8 + 0)
#define                                 PRLOCKED_bit        _BIT_ACCESS(PRLOCK,0)
// WDTCON0<PS0>
extern volatile __bit                   PS0                 __at(0x3C1);	// @ (0x78 * 8 + 1)
#define                                 PS0_bit             _BIT_ACCESS(WDTCON0,1)
// WDTCON0<PS1>
extern volatile __bit                   PS1                 __at(0x3C2);	// @ (0x78 * 8 + 2)
#define                                 PS1_bit             _BIT_ACCESS(WDTCON0,2)
// WDTCON0<PS2>
extern volatile __bit                   PS2                 __at(0x3C3);	// @ (0x78 * 8 + 3)
